[{"user_id": "Ajia A.", "rating": 5.0, "date": "2019-02-07", "text": "I can't believe it took me this long to try this place out.  Authentic Puerto Rican food is hard to come by honestly.   However, I don't really think you will be able to get better, unless you are Puerto Rican and cooking that good ish at home.\n\nThe arroz con gandules was flavorful and authentic, and I also had the half steak Jibarito which was yummy.  Also grab all the sauces for extra goodness...ok I also tried the shrimp empanada which was pretty good as well (but if would go with the jibarito sandwiches over an empanada plate per the menu) .    \n\nDefinitely one of my new go-to spots since I live just around the corner!\n"}, {"user_id": "Omar D.", "rating": 5.0, "date": "2018-12-23", "text": "We ordered a large tray of arroz con gandules for our annual holiday party and the reviews by our guests where unanimous...best they have had in Chicago. \n\nWe also go there about once per month for a Jibarito. Finally, I enjoy their pasteles.\n"}, {"user_id": "Rosie D.", "rating": 5.0, "date": "2018-11-06", "text": "I absolutely love this place and I love their food! I'm not just saying this to be nice. I grew up in Humboldt Park from the late 1980s to present day. I have been to almost every PR restaurant in the city and even the food trucks in the park. \n\nI remember trying the Jibarito sandwich from the original restaurant that created it, it was an amazing experience and I haven't had an experience like that lately. A lot of restaurants have disappointed with soggy plantains or the side of arroz con gandules lacked flavor. \n\nBut at The Jibarito stop, everything is perfectly cooked and has so much flavor. The customer service is amazing - owners are super friendly and service is great.\n"}, {"user_id": "Jennie C.", "rating": 4.0, "date": "2019-01-02", "text": "Pleasant surprise! Can't believe we haven't even noticed this place despite living in the neighborhood. The interior is nice and clean, music at a reasonable volume level. We ordered a full pork Jibarito and a half steak Jibarito, with a side of sweet plantains. Both Jibaritos came with a huge portion of rice with ham, which was so good I picked up every single kernel...the jibarito was delicious, love the texture contrast between the fried plantain and soft meats, although one might argue the steak version wasn't technically steak (ie not the best cut of meat). The steak one was also a lot more greasy, I ended up with a puddle of grease on my plate, so will probably stick with the pork next time. The sweet plantain was delicious but really too much food for me. Regardless, I'd happily return, regularly!\n"}, {"user_id": "Jen B.", "rating": 5.0, "date": "2019-01-03", "text": "The full size steak jibarito was perfect to share, as you get two sandwiches. The arroz con gandules was tasty, the pork was like a cross between ham and bacon. We also tried a relleno de papa, a fried potato ball that was stuffed with ground beef. Everything was made fresh, and the employees were very friendly.\n"}, {"user_id": "Ivy D.", "rating": 4.0, "date": "2018-10-31", "text": "Who doesn't love a good empanada? I mean, come on! \n\nI got the Empanada Basket which comes with your choice of beef and cheese, veggies or shrimp (additional $0.75), rice, mayoket and cilantro tamarind sauce for $6.75. We also got a relleno (stuffed potato ball with meat), which I was super excited for!\n\nThe shrimp filling in the empanada was probably my favorite. But I love seafood, so I'm probably biased. The beef and cheese was pretty good too,. The cilantro tamarind sauce was what I was really interested in trying. I really like the flavor of it, but just I just wish it was less sweet and more tamarind. I think the flavor of the tamarind got lost in it the cilantro. But a good accompaniment nonetheless. The stuffed potato ball, I found the potato to be not as fluffy as I would have liked. It had a nice crunchy exterior with a meat feeling that was good though. \n\nOverall, good experience, would definitely stop by for the empanadas if I'm even back in Pilsen.\n"}, {"user_id": "Mike K.", "rating": 4.0, "date": "2019-02-08", "text": "Great place service and food it was my first time at the restaurant and ready to go back already .\n"}, {"user_id": "Linda G.", "rating": 5.0, "date": "2019-02-04", "text": "This place is amazing! The Jibarito's are definitely the best I've had by far. They are full of flavor and the meat is soft and tender. Being a south-sider, the best part is that this is in Pilsen and i don't have to travel very far for good food. We also ordered the Yucca fries. Also very good, especially with the garlic butter on top. Also, the parcha was good. not too sweet!\n"}, {"user_id": "Deena H.", "rating": 4.0, "date": "2018-07-14", "text": "This little shop has Puerto Rican food that'll make you think you're in San Juan. The food here is delicious. What makes them stand out from other Puerto Rican cuisine in Chicago is that they cook and fry to order so nothing is sitting under a heat lamp or was cooked hours ago. \n\nMy favorite is their piñón which is like a Puerto Rican lasagna with green plantains, beef and cheese. Their yucca are good too. \n\nThey make a coconut custard dessert that is also yummy and their \"whipped potatoes\" are a creamy potato salad with a crunch and punch of spice that will have you wanting more. \n\nThey recently also joined uberEATS so if you're not in the mood to drive to their shop, you might be in their delivery zone. \n\nThe staff here is very friendly and if you're not familiar with the cuisine, they will walk you thru the menu. They have two different rice and beans options: one made with a pork base and one that is vegetarian. They have some Puerto Rican sodas here too. Wish parking was easier to find. \n\nAll in all, awesome place to eat.\n"}, {"user_id": "Tiffany Z.", "rating": 5.0, "date": "2018-07-08", "text": "Was a pipping hot Sunday in Pilsen, but I was determined to try a jibarito before I left town after graduation. So worth it! \nI ordered a half size veggie jibarito with beans and rice. From the crunchy plantains to the soft beans, my meal was a delicious array of textures; even the beans and rice were flavorful! My friend was feeling full so she only had a side of sweet plantain - that was yummy as well, piping hot and not too sweet. I've never had Puerto Rican food before, so I can't comment on its authenticity, but I had a great experience and am glad I bookmarked this spot.\n"}, {"user_id": "Tam N.", "rating": 5.0, "date": "2018-05-21", "text": "Jibaritos are Chicago made. Just as deep dish pizza comes hand in hand with Chicago, so should jibaritos.\n\nA sandwich but with fried plantains for the \"bread\" with oh so good garlic sauce/mayo spread. I really like the jibarito shop. Since its in Pilsen neighborhood and on 18th street, you know its legit.\n\nThe plantains are super crispy and thin. The flavored rice that comes with it is really good. Half orders are $6.25 and full orders are $9.50. I'm full off the half order but if I had a friend who wanted to share, the full order is perfect for 2 not so hungry people. Though I'm sure someone with a big appetite can finish a full order without and problems.\n\nCheck this place out and support local shops!\n"}, {"user_id": "Washieka T.", "rating": 5.0, "date": "2019-01-31", "text": "I had the steak jibarito with arroz con gandules with passion fruit and bought some coco Rico to take home. It was great the selection of condiments was good and the sandwich was hearty and they didn't skimp on the meat either the rice was soft but not mushy. I plan on going back there this week\n"}, {"user_id": "Shirlene L.", "rating": 5.0, "date": "2018-06-18", "text": "Great first experience with Puerto Rican food!  But disclaimer cause I don't have anything else to compare it to.\n\nSuper flavoral jibarito with a perfectly crisp tostone. The arroz it is served with is also packed with flavor and the steak and cheese empanada was also very good. A full size jibarito and single empanada was enough for two of us to eat as a decently light lunch. Tried their passion fruit juice - really tasty, but a little too sweet for me.\n"}, {"user_id": "Andrew M.", "rating": 5.0, "date": "2018-04-11", "text": "You know that feeling when food is so good, that you feel sad after eating it because it's gone and you want more? That's what's going to happen to you if you eat at The Jibarito Stop. \n\nI ordered take-out, so I can only really speak for the food, but in the 30 seconds I was in the restaurant, I noticed that they had tons of seating, the menu was very clear and easy to read, prices were VERY reasonable, and it smelled really great (maybe I was just hungry...).\n\nI got the full steak jibarito order with arroz con gandules and a side of yuca fries. And it everything was honestly amazing/fantastic/incredible. The jibarito with filled with meat and the tostones were perfectly cooked so that they weren't too soggy but also not as hard as a rock. The arroz con gandules is the perfect complement for the jibarito. And those yuca fries were life changing; it was crunchy, starchy perfection.\n\nNot sure if this is the best place to come if you're on a diet, but it's definitely the best place to come if you're looking for some delicious, cheap Puerto Rican food.\n"}, {"user_id": "Raneen R.", "rating": 5.0, "date": "2019-01-22", "text": "I am on a plaintain binge lately, don't know why. But I was thrilled to see that this place has everything plantain. I had the veggie sandwich with the yellow rice, and a side of garlic plantains. Good portions, very delicious. Next time I'll try the sweet plaintain!\n"}, {"user_id": "Daisy D.", "rating": 5.0, "date": "2019-02-03", "text": "The Jibarito stop had a nice ambience and variety of things to choose from. It had options for vegetarians and a really good salad that could have used more chicken but overall it was very tasty. The arroz con gandules was very good, as well! My daughters loved it! Will definitely be going back.\n"}, {"user_id": "Hannah L.", "rating": 3.0, "date": "2018-07-22", "text": "3.5 stars. Stopped by on a Sunday around noon. I wasn't too hungry so I just went with a beef and cheese empanada. My friend got the half steak jibarito. We also shared an order of plantains. The empanada was a tad smaller than I had expected and was a little too soupy and drippy for my liking. The meat was very flavorful and the shell was perfectly crispy on the outside. It was delightful. While the jibarito wasn't terrible, it was too dry for our liking.  On the other hand, the plantains were absolutely lovely and I'd surely return to have them again!\n"}, {"user_id": "Michelle T.", "rating": 5.0, "date": "2017-12-31", "text": "WEPA!!! The absolute most juiciest lechon you'll find in Chicago, next to home cooking. That's what makes this Jibarito 5 Stars! The pork was dripping everywhere! The tostone holding it together was the perfect consistency! Chihuahua cheese, tomato, & lettuce to top! Pure perfection! I never thought I'd see the day when a NEW Lechon Jibarito would surpass the one from La Cocina Boricua. It has happened. I never finish my plate but for my first time trying Jibarito Stop, I ate the entire plate. Arroz con Gondules was fantastic bc it had pieces of meat in it. Mmm! That's serious! \n\nAlthough it's an in & out shop and doesn't really have any ambiance or decor, you'll leave super satisfied from down right amazing food. Service was genuinely caring. Even though you order at the counter, the cashier walked around and made sure everyone was taken care of. He even brought our plastic silverware over for us when I could have walked over to the condiment station  myself. \n\nAmazing. Nuff Said.\n"}, {"user_id": "Samantha V.", "rating": 3.0, "date": "2018-08-01", "text": "IF I have to choose between \"great\" and \"ok\" I say just ok. I would say 3.5 stars. It was decent enough, but I rounded down because I am so tired of seeing such inflated generous reviews that make it impossible to judge the actual reality of what to expect.\n\nGrub hub ordered through yelp...$8 delivery is EXCESSIVE. Why such a crazy high charge?! It really drives down the value for what you get.\n\nWe ordered the full orders of the pulled pork and the chicken jibaritos, the shrimp and potato empanadas, the yellow rice and soft plantains. $38 before tip. A bit steep.\n\nNot sure how excited I am about the plantain buns since they are kind of hard and dry, though they have good flavor and it's an interesting concept, especially if you have gluten restrictions. Everything else tastes really good though. \n\nI really like the yellow rice and peas, and they give really nice portions. \n\nThe soft plantains that came with the empanadas were standard but good. \n\nThe meat was flavorful and very tasty and overall the meal was very filling.\n\nThe delivery was about 15 min late though, on an hour delivery as it is, and at highway rapery price, I'd rather eat there!\n\nI would eat here again but just get the empanadas, rice  and plantains. \n\nDefinitely a nice change from the Mexican, Chinese, pizza takeout rotation.\n"}, {"user_id": "Bill M.", "rating": 4.0, "date": "2018-05-18", "text": "I used to order food from The Jibarito Stop food truck when it made its rounds in the Loop, and I missed it when I heard that they were retiring the food truck but opening its very own restaurant on 18th Street.  Ironically they did not sell any jibaritos from the food truck! \n\nOn a rainy Saturday afternoon, I finally made it to the actual restaurant.  My lovely friend and I stared at the board and we both agreed that everything looked good on the menu (and the restaurant smelled like it was cranking out some good food too).  You could almost call this place The Plantain Stop as the menu is chock full of dishes featuring plantain.  This place is simply designed as a casual dining spot, so first you order your food at the register.  The tables and chairs are pretty basic too, with some interesting items displayed on the walls (Puerto Rico flag guitar, photos etc.).  There is a water dispenser and plastic utensils around the corner from the register. \n\nWe ordered a full jibarito piled with pork, Chihuahua cheese, lettuce / tomato / mayo and finally smeared in garlic.  Rather than the usual long jibarito that is cut in half, they make it into two sort-of sliders, so it is easy to eat and share the jibarito experience.  I loved this platter that comes along with the side of arroz con gandules.  The only minus was that the edges of the jibarito plantain was a bit too chewy, but otherwise this was a delicious ensemble.  We tried the alcapurria, the classic fritter with the plantain / green banana shell stuffed with ground beef.  For kicks and giggles we also tried the piñon, described as a Puerto Rican lasagna.  This dish came out piping hot in a tin foil tray, with layers of ground beef, gooey cheese and sweet plantains.  The piñon is a rich dish that is simultaneously sweet and savory, and best shared with someone.  I'd definitely love to stop in at The Jibarito Stop again sometime.\n"}]