[{"user_id": "Stan V.", "rating": 5.0, "date": "2016-05-15", "text": "Living in Pilsen, I heard of this place a million times. I had to try it. I ordered a steak jabarito to go. They were really nice people and the food was amazing. I don't just through around five stars... I think they were that  great. The cooks looked a little grumpy, lol, buy hey... that's fine. They make amazing food, you can be grumpy:)  I highly recommend them.\n"}, {"user_id": "Sarah C.", "rating": 5.0, "date": "2015-11-10", "text": "The Jibarito Stop just opened up a new restaurant a few blocks from my work, and I couldn't be more excited.  Always on the lookout for new lunch places and eager to support new local businesses, myself and the rest of the folks in my office decided to order take out and give it a go.  The reviews were unanimous... the food was delicious.  Given that the name of the restaurant is the Jibarito Stop, I figured I had no choice but to try a Jibarito.  I was a little skeptical on the combination of ingredients (not being a huge plantain fan), but figured \"when in Rome!\".  I couldn't have been happier with my choice.  I chose a Steak Jibarito, which comes with a big ol' serving of arroz con gandules (rice with pigeon peas).  The steak was wonderfully seasoned, and the plantain \"bun\" gave it just the right flavor.  Very happy to see such a great addition to the neighborhood and looking forward to trying some more items from the menu!\n"}, {"user_id": "Dan O.", "rating": 5.0, "date": "2016-03-29", "text": "This food was amazing, so much so that I had to write a yelp review!  The veggie jibarito rocked my world and even the white rice and beans were well seasoned.  I want to come back!  My only complaint was the styrofoam cups and plastic utensils.\n"}, {"user_id": "Amanda P.", "rating": 5.0, "date": "2016-03-28", "text": "I am very disappointed in myself.  I thought I had given The Jibarito Stop their 5 star reviews ages ago!  \nI started off frequenting The Jibarito Stop when they were a food truck in the Loop.  They have, hands down, the best beef and cheese empanadas. Now that their store front is open in Pilsen, The Jibarito Stop is finally able to serve their name sake sandwich.  My go to is the steak jibarito. It is piled with tender, flavorful steak and topped with your choice of cheese.  You cannot go wrong with this classic.  I have my husband stop in every 6 weeks on his way home from getting a hair cut near Bridgeport.  The food is so good I don't even care that it is usual cold by the time I make it home from work. I don't think there is much higher praise than still good when room temp!  \nSo trust me, go get a jibarito and some beef empanadas and if there is flan available, grab that too.  You can thank me when you wake from your food coma\n"}, {"user_id": "Jessica G.", "rating": 2.0, "date": "2016-03-10", "text": "Not the best puerto rican food. Since its the only one on the south side it will do. Being puerto rican i suggest to use fresh made sofrito its lacking the flavor.\n"}, {"user_id": "Daniel R.", "rating": 5.0, "date": "2016-04-24", "text": "Great food! The steak jibarito is amazing! Staff is always friendly and food comes out hot and fast! A great addition to 18th street eateries.\n"}, {"user_id": "Carl P.", "rating": 5.0, "date": "2016-02-20", "text": "Been here quite a few times, the food is fantastic and affordable, best Jibarito in town IMHO. I usually get the pork with pepperjack cheese, with the beans and white rice.  Also get the flan, delicious!\n"}, {"user_id": "Remesis G.", "rating": 5.0, "date": "2016-02-01", "text": "What a great restaurant! I discovered this place on Grubhub and it was great. There aren't a lot of Puerto Rican restaurants in the South Loop/Pilsen and this place is a godsend. I had the steak jibarito which was delicious. It came with yummy yellow rice with peas. The empanadas are unbelievable. You have to order them. They're huge! We also had the fried plantains (rostones) and they were great too. There just weren't alot of them. Lastly, we had the whipped potatoes as a side. I was surprised because they were COLD. I think that is how they are supposed to be served but I wasn't expecting it.other than that, this place is a very value and I'll be back!\n"}]