[{"user_id": "Ajia A.", "rating": 5.0, "date": "2019-02-07", "text": "I can't believe it took me this long to try this place out.  Authentic Puerto Rican food is hard to come by honestly.   However, I don't really think you will be able to get better, unless you are Puerto Rican and cooking that good ish at home.\n\nThe arroz con gandules was flavorful and authentic, and I also had the half steak Jibarito which was yummy.  Also grab all the sauces for extra goodness...ok I also tried the shrimp empanada which was pretty good as well (but if would go with the jibarito sandwiches over an empanada plate per the menu) .    \n\nDefinitely one of my new go-to spots since I live just around the corner!\n"}, {"user_id": "Omar D.", "rating": 5.0, "date": "2018-12-23", "text": "We ordered a large tray of arroz con gandules for our annual holiday party and the reviews by our guests where unanimous...best they have had in Chicago. \n\nWe also go there about once per month for a Jibarito. Finally, I enjoy their pasteles.\n"}, {"user_id": "Rosie D.", "rating": 5.0, "date": "2018-11-06", "text": "I absolutely love this place and I love their food! I'm not just saying this to be nice. I grew up in Humboldt Park from the late 1980s to present day. I have been to almost every PR restaurant in the city and even the food trucks in the park. \n\nI remember trying the Jibarito sandwich from the original restaurant that created it, it was an amazing experience and I haven't had an experience like that lately. A lot of restaurants have disappointed with soggy plantains or the side of arroz con gandules lacked flavor. \n\nBut at The Jibarito stop, everything is perfectly cooked and has so much flavor. The customer service is amazing - owners are super friendly and service is great.\n"}, {"user_id": "Jennie C.", "rating": 4.0, "date": "2019-01-02", "text": "Pleasant surprise! Can't believe we haven't even noticed this place despite living in the neighborhood. The interior is nice and clean, music at a reasonable volume level. We ordered a full pork Jibarito and a half steak Jibarito, with a side of sweet plantains. Both Jibaritos came with a huge portion of rice with ham, which was so good I picked up every single kernel...the jibarito was delicious, love the texture contrast between the fried plantain and soft meats, although one might argue the steak version wasn't technically steak (ie not the best cut of meat). The steak one was also a lot more greasy, I ended up with a puddle of grease on my plate, so will probably stick with the pork next time. The sweet plantain was delicious but really too much food for me. Regardless, I'd happily return, regularly!\n"}, {"user_id": "Jen B.", "rating": 5.0, "date": "2019-01-03", "text": "The full size steak jibarito was perfect to share, as you get two sandwiches. The arroz con gandules was tasty, the pork was like a cross between ham and bacon. We also tried a relleno de papa, a fried potato ball that was stuffed with ground beef. Everything was made fresh, and the employees were very friendly.\n"}, {"user_id": "Ivy D.", "rating": 4.0, "date": "2018-10-31", "text": "Who doesn't love a good empanada? I mean, come on! \n\nI got the Empanada Basket which comes with your choice of beef and cheese, veggies or shrimp (additional $0.75), rice, mayoket and cilantro tamarind sauce for $6.75. We also got a relleno (stuffed potato ball with meat), which I was super excited for!\n\nThe shrimp filling in the empanada was probably my favorite. But I love seafood, so I'm probably biased. The beef and cheese was pretty good too,. The cilantro tamarind sauce was what I was really interested in trying. I really like the flavor of it, but just I just wish it was less sweet and more tamarind. I think the flavor of the tamarind got lost in it the cilantro. But a good accompaniment nonetheless. The stuffed potato ball, I found the potato to be not as fluffy as I would have liked. It had a nice crunchy exterior with a meat feeling that was good though. \n\nOverall, good experience, would definitely stop by for the empanadas if I'm even back in Pilsen.\n"}, {"user_id": "Mike K.", "rating": 4.0, "date": "2019-02-08", "text": "Great place service and food it was my first time at the restaurant and ready to go back already .\n"}, {"user_id": "Linda G.", "rating": 5.0, "date": "2019-02-04", "text": "This place is amazing! The Jibarito's are definitely the best I've had by far. They are full of flavor and the meat is soft and tender. Being a south-sider, the best part is that this is in Pilsen and i don't have to travel very far for good food. We also ordered the Yucca fries. Also very good, especially with the garlic butter on top. Also, the parcha was good. not too sweet!\n"}, {"user_id": "Deena H.", "rating": 4.0, "date": "2018-07-14", "text": "This little shop has Puerto Rican food that'll make you think you're in San Juan. The food here is delicious. What makes them stand out from other Puerto Rican cuisine in Chicago is that they cook and fry to order so nothing is sitting under a heat lamp or was cooked hours ago. \n\nMy favorite is their piñón which is like a Puerto Rican lasagna with green plantains, beef and cheese. Their yucca are good too. \n\nThey make a coconut custard dessert that is also yummy and their \"whipped potatoes\" are a creamy potato salad with a crunch and punch of spice that will have you wanting more. \n\nThey recently also joined uberEATS so if you're not in the mood to drive to their shop, you might be in their delivery zone. \n\nThe staff here is very friendly and if you're not familiar with the cuisine, they will walk you thru the menu. They have two different rice and beans options: one made with a pork base and one that is vegetarian. They have some Puerto Rican sodas here too. Wish parking was easier to find. \n\nAll in all, awesome place to eat.\n"}, {"user_id": "Tiffany Z.", "rating": 5.0, "date": "2018-07-08", "text": "Was a pipping hot Sunday in Pilsen, but I was determined to try a jibarito before I left town after graduation. So worth it! \nI ordered a half size veggie jibarito with beans and rice. From the crunchy plantains to the soft beans, my meal was a delicious array of textures; even the beans and rice were flavorful! My friend was feeling full so she only had a side of sweet plantain - that was yummy as well, piping hot and not too sweet. I've never had Puerto Rican food before, so I can't comment on its authenticity, but I had a great experience and am glad I bookmarked this spot.\n"}, {"user_id": "Tam N.", "rating": 5.0, "date": "2018-05-21", "text": "Jibaritos are Chicago made. Just as deep dish pizza comes hand in hand with Chicago, so should jibaritos.\n\nA sandwich but with fried plantains for the \"bread\" with oh so good garlic sauce/mayo spread. I really like the jibarito shop. Since its in Pilsen neighborhood and on 18th street, you know its legit.\n\nThe plantains are super crispy and thin. The flavored rice that comes with it is really good. Half orders are $6.25 and full orders are $9.50. I'm full off the half order but if I had a friend who wanted to share, the full order is perfect for 2 not so hungry people. Though I'm sure someone with a big appetite can finish a full order without and problems.\n\nCheck this place out and support local shops!\n"}, {"user_id": "Washieka T.", "rating": 5.0, "date": "2019-01-31", "text": "I had the steak jibarito with arroz con gandules with passion fruit and bought some coco Rico to take home. It was great the selection of condiments was good and the sandwich was hearty and they didn't skimp on the meat either the rice was soft but not mushy. I plan on going back there this week\n"}, {"user_id": "Shirlene L.", "rating": 5.0, "date": "2018-06-18", "text": "Great first experience with Puerto Rican food!  But disclaimer cause I don't have anything else to compare it to.\n\nSuper flavoral jibarito with a perfectly crisp tostone. The arroz it is served with is also packed with flavor and the steak and cheese empanada was also very good. A full size jibarito and single empanada was enough for two of us to eat as a decently light lunch. Tried their passion fruit juice - really tasty, but a little too sweet for me.\n"}, {"user_id": "Andrew M.", "rating": 5.0, "date": "2018-04-11", "text": "You know that feeling when food is so good, that you feel sad after eating it because it's gone and you want more? That's what's going to happen to you if you eat at The Jibarito Stop. \n\nI ordered take-out, so I can only really speak for the food, but in the 30 seconds I was in the restaurant, I noticed that they had tons of seating, the menu was very clear and easy to read, prices were VERY reasonable, and it smelled really great (maybe I was just hungry...).\n\nI got the full steak jibarito order with arroz con gandules and a side of yuca fries. And it everything was honestly amazing/fantastic/incredible. The jibarito with filled with meat and the tostones were perfectly cooked so that they weren't too soggy but also not as hard as a rock. The arroz con gandules is the perfect complement for the jibarito. And those yuca fries were life changing; it was crunchy, starchy perfection.\n\nNot sure if this is the best place to come if you're on a diet, but it's definitely the best place to come if you're looking for some delicious, cheap Puerto Rican food.\n"}, {"user_id": "Raneen R.", "rating": 5.0, "date": "2019-01-22", "text": "I am on a plaintain binge lately, don't know why. But I was thrilled to see that this place has everything plantain. I had the veggie sandwich with the yellow rice, and a side of garlic plantains. Good portions, very delicious. Next time I'll try the sweet plaintain!\n"}, {"user_id": "Daisy D.", "rating": 5.0, "date": "2019-02-03", "text": "The Jibarito stop had a nice ambience and variety of things to choose from. It had options for vegetarians and a really good salad that could have used more chicken but overall it was very tasty. The arroz con gandules was very good, as well! My daughters loved it! Will definitely be going back.\n"}, {"user_id": "Hannah L.", "rating": 3.0, "date": "2018-07-22", "text": "3.5 stars. Stopped by on a Sunday around noon. I wasn't too hungry so I just went with a beef and cheese empanada. My friend got the half steak jibarito. We also shared an order of plantains. The empanada was a tad smaller than I had expected and was a little too soupy and drippy for my liking. The meat was very flavorful and the shell was perfectly crispy on the outside. It was delightful. While the jibarito wasn't terrible, it was too dry for our liking.  On the other hand, the plantains were absolutely lovely and I'd surely return to have them again!\n"}, {"user_id": "Michelle T.", "rating": 5.0, "date": "2017-12-31", "text": "WEPA!!! The absolute most juiciest lechon you'll find in Chicago, next to home cooking. That's what makes this Jibarito 5 Stars! The pork was dripping everywhere! The tostone holding it together was the perfect consistency! Chihuahua cheese, tomato, & lettuce to top! Pure perfection! I never thought I'd see the day when a NEW Lechon Jibarito would surpass the one from La Cocina Boricua. It has happened. I never finish my plate but for my first time trying Jibarito Stop, I ate the entire plate. Arroz con Gondules was fantastic bc it had pieces of meat in it. Mmm! That's serious! \n\nAlthough it's an in & out shop and doesn't really have any ambiance or decor, you'll leave super satisfied from down right amazing food. Service was genuinely caring. Even though you order at the counter, the cashier walked around and made sure everyone was taken care of. He even brought our plastic silverware over for us when I could have walked over to the condiment station  myself. \n\nAmazing. Nuff Said.\n"}, {"user_id": "Samantha V.", "rating": 3.0, "date": "2018-08-01", "text": "IF I have to choose between \"great\" and \"ok\" I say just ok. I would say 3.5 stars. It was decent enough, but I rounded down because I am so tired of seeing such inflated generous reviews that make it impossible to judge the actual reality of what to expect.\n\nGrub hub ordered through yelp...$8 delivery is EXCESSIVE. Why such a crazy high charge?! It really drives down the value for what you get.\n\nWe ordered the full orders of the pulled pork and the chicken jibaritos, the shrimp and potato empanadas, the yellow rice and soft plantains. $38 before tip. A bit steep.\n\nNot sure how excited I am about the plantain buns since they are kind of hard and dry, though they have good flavor and it's an interesting concept, especially if you have gluten restrictions. Everything else tastes really good though. \n\nI really like the yellow rice and peas, and they give really nice portions. \n\nThe soft plantains that came with the empanadas were standard but good. \n\nThe meat was flavorful and very tasty and overall the meal was very filling.\n\nThe delivery was about 15 min late though, on an hour delivery as it is, and at highway rapery price, I'd rather eat there!\n\nI would eat here again but just get the empanadas, rice  and plantains. \n\nDefinitely a nice change from the Mexican, Chinese, pizza takeout rotation.\n"}, {"user_id": "Bill M.", "rating": 4.0, "date": "2018-05-18", "text": "I used to order food from The Jibarito Stop food truck when it made its rounds in the Loop, and I missed it when I heard that they were retiring the food truck but opening its very own restaurant on 18th Street.  Ironically they did not sell any jibaritos from the food truck! \n\nOn a rainy Saturday afternoon, I finally made it to the actual restaurant.  My lovely friend and I stared at the board and we both agreed that everything looked good on the menu (and the restaurant smelled like it was cranking out some good food too).  You could almost call this place The Plantain Stop as the menu is chock full of dishes featuring plantain.  This place is simply designed as a casual dining spot, so first you order your food at the register.  The tables and chairs are pretty basic too, with some interesting items displayed on the walls (Puerto Rico flag guitar, photos etc.).  There is a water dispenser and plastic utensils around the corner from the register. \n\nWe ordered a full jibarito piled with pork, Chihuahua cheese, lettuce / tomato / mayo and finally smeared in garlic.  Rather than the usual long jibarito that is cut in half, they make it into two sort-of sliders, so it is easy to eat and share the jibarito experience.  I loved this platter that comes along with the side of arroz con gandules.  The only minus was that the edges of the jibarito plantain was a bit too chewy, but otherwise this was a delicious ensemble.  We tried the alcapurria, the classic fritter with the plantain / green banana shell stuffed with ground beef.  For kicks and giggles we also tried the piñon, described as a Puerto Rican lasagna.  This dish came out piping hot in a tin foil tray, with layers of ground beef, gooey cheese and sweet plantains.  The piñon is a rich dish that is simultaneously sweet and savory, and best shared with someone.  I'd definitely love to stop in at The Jibarito Stop again sometime.\n"}, {"user_id": "Christopher V.", "rating": 5.0, "date": "2018-05-19", "text": "Another placeholder so my pictures link. I'll update with details later, but the 5 star rating holds true.\n"}, {"user_id": "Mari R.", "rating": 3.0, "date": "2018-12-19", "text": "Tried this place for the first time this week. I ordered the steak Jibarito with arroz con gandules. The food had good flavor but the steak had so much salt. Way way too much salt. The meat was almost inedible due to the salt content. I had to wash down with several cups of water. The rice was very good. Maybe it was just an off day. The prices seem higher than Puerto Rican resteraunts on the north side.  Would try again if in the area but would definitely ask them to go lightly on the salt.\n"}, {"user_id": "Lauren B.", "rating": 1.0, "date": "2019-02-02", "text": "Waited 30 minutes for a sit in order.  Just ask for the order to go then,  took another 5 minutes for the guy to put my order in a container.  I finally asked for a refund and example to the lady at the counter why.  She we are busy, we should be patient.  Worse experience!!! Only gave me a refund for the food and made me pay for the coke I ordered.  She literally was refunding me while the food was in a bag next to her.  They should have apologized, gave me the food with part of a refund, or a coupon for free food for next visit, or comped my order.  No!  They just let me leave like nothing!  Crazy!!!\n"}, {"user_id": "Cassandra R.", "rating": 5.0, "date": "2018-11-08", "text": "I grew up eating delicious homemade arroz con gandules and this restaurant exceeded my expectations! \n\nThis place is better than most of the restaurants I grew up eating at in humboldt park. I had half steak Jibarito w arroz con gandules and one alcapuria. Delicious!! \n\nInstead of hopping on a flight to go to the homeland for good food, I'll drive here\n"}, {"user_id": "Shannon K.", "rating": 4.0, "date": "2018-06-06", "text": "Chose to eat dinner here after my Airbnb host suggested it. I came around 5 pm on a Wednesday, but I wish I had come with a bigger appetite!\nI chose the Jibarito steak sandwich and subbed tostones for the rice. I was satisfied with the sandwich, the steak was cooked well but still juicy. The tostones were out of this world! Crispy, garlicky deliciousness. Also tried the passion fruit juice and it did not disappoint! It's sweetness complimented the spicy garlic tostones. In all, a solid meal.\n"}, {"user_id": "Maiesha T.", "rating": 5.0, "date": "2017-08-14", "text": "This place is AMAZING!!!!!!  On my first visit, I had the half steak jibarito with arroz condules and a side of fried sweet plantains. I was so full.  I dreamed about this place for the next couple of days, and returned shortly after.  I could not get over the garlicky plantain taste and the tenderness and flavor or the steak.   Since then, I've been about 5 times and  I've never been disappointed.  The passion fruit juice is SOOOO good!!!!  It reminds me of being in Grenada and my grandmother making it from scratch.  Get the juice and sweet plantains.  \n\nI'll try to explore the menu more but I'm pretty content with the food I've had so far.\n"}, {"user_id": "Hannah K.", "rating": 3.0, "date": "2018-02-03", "text": "It may just be that I don't like Puerto Rican food... but I found everything bland bland bland. We had to wait about 20 minutes for our food which isn't bad but the restaurant is set up as a fast casual and isn't the most comfortable place to wait a long time to get the food. The jibaritos are filling, smothered in garlic and messy to eat. The beans and rice were fantastic. Their relleno a fried ball of potato and beef seems to be the go to order, but the empanadas, yucca fries, and sweet plantains were my favorite. This place is popular, filling, and clean. I don't think I will eat here again but it's a great choice in Pilsen.\n"}, {"user_id": "Samantha M.", "rating": 5.0, "date": "2018-08-21", "text": "We ordered through Postmates and were not disappointed! The steak jibarito was cooked to perfection and I could not get enough of the arroz con gandules (I wish I ordered more). We definitely will be ordering from there again.\n"}, {"user_id": "5onny G.", "rating": 1.0, "date": "2019-01-24", "text": "100 percent honest,,,,,Last night I decided to take my date to this place ,been heard about it for some time now ,so I said I'll give it a shot . I've eating lots of jibarito s in my life but this place topped it  as one of the WORST!  Yet.   We ordered the half portion . It wasn't long till we got served but it was probably because nothing was fresh . I kid you not I thought my date broke a tooth biting down on the plantain solid as a rock . I'll give them the benefit of the doubt could have been do the fact it was one hour before close but that shouldn't give them the right to serve food that was been sitting under a heat lamp for hours.  I suggest go in the early hours you might have better luck than me .\n"}, {"user_id": "Trina K.", "rating": 3.0, "date": "2017-05-26", "text": "If my attempt to place my order by phone were not completely derailed by the cashier, the overall rating would be four stars. \n\nWhile maneuvering through heavy Friday traffic during a torrential downpour, I decided to make a stop for a Empanadas, Arroz con granules (rice and pigeon peas) & a Papa Rellena. \n\nAfter parking, the rain began to come down with added force so I decided to call in the order knowing that the frying time would take a few minutes and in hopes that the rain would slack up. From my parking space, I could see the person who answered and immediately asked me to hold. About 30 seconds later, a patron runs in and orders. The cashier picked up the phone three times to put it back on hold as to silence the hold ringback reminder. After I watched a gentleman get out, pay and cross the street with his food in hand, I realized going in was THE ONLY option. Guess what? As soon as I walked in, She said can I help you? I said sure, but first why am I holding all this time to do the same thing? \n\nSomeone in back approached the cashier after I paid to ask her about the reason I was left holding. The person then made sure each phone order was taken by someone else. \n\nMy items were delicious. Nice portion, under $10 and made to order. Can sodas are .99 and there are also bottled beverages.\n\n\nWill definitely return and can perhaps update my review at that time.\n"}, {"user_id": "Jess R.", "rating": 5.0, "date": "2017-12-10", "text": "This is one of the best Puerto Rican places to eat in the city. It's a simple setup but a cool old building. The Jibarito is amazing. If you get the garlic plantain it is tons of garlic, just so you know. Everything is great. Chicken and onions is smooth and tasty. No dish was disappointing! It's noisy here but you won't care.\n"}, {"user_id": "Demi W.", "rating": 5.0, "date": "2018-07-24", "text": "Had the empanadas and rice, full of flavor. Shrimp is worth the upcharge. Plus, cool atmosphere and natural light. A great first experience with Puerto Rican cuisine! Also, it's pretty cheap. Definitely check it out if you're in the area. A++\n"}, {"user_id": "Briana H. K.", "rating": 5.0, "date": "2018-07-30", "text": "Food - 5 Stars\nAtmosphere - 5 stars \nLocation - 5 stars\nParking - 2 stars\n\nI love Puerto Rican Food. As soon as you walk in the door you can smell the greatness of PUERTO RICAN cuisine! Not only do they have jibaritos, they have empanadas and the key staples - puerto rican style! \n\nThe link was out the door. the location is on the street and parking is VERY slim on the streets. This location is a walk up style restaurant. Inside it cool. Nice and open atmosphere. Nothing super fancy. \n\nI can't wait to come back here to eat again!\n"}, {"user_id": "Ndidi B.", "rating": 3.0, "date": "2018-07-15", "text": "Found this place after a Google search for nearby BYOB spots. \n\nWe decided to split an order of a half chicken jibarito, full steak jibarito, and the appetizer sampler which consisted of the banana dumpling [alcapurria], relleno [another meat stuffed dumpling, not the pepper] and three of the empanadas [beef, shrimp, vegetable].\n\nIt was my sisters first time having a jibarito and we thoroughly enjoyed them, both agreeing that the steak was the better of the two. We didn't get a chance to enjoy the arroz con grandules, because they had run out, but the white rice was well cooked and salted. \n\nOddly enough, we received the sandwiches before the appetizers and by the time the appetizers arrived, we'd already finished the jibaritos. The dumplings were interesting and definitely an acquired taste, more than likely developed by folks who have been eating them their whole life. The empanadas were also interestingly flavored. We liked the ground beef and veggie. The shrimp was really fishy in an unpleasant way, and the quality of the shrimp was not good. \n\nThat being said, the three stars are solely for the jibaritos. They lose two stars for lack of air conditioning and ice, or the lack thereof.\n"}, {"user_id": "Jacquelyn Z.", "rating": 1.0, "date": "2018-09-29", "text": "Not at all Puerto Rican. Not if you've ever had a real Jibarito. I asked for two steak Jibaritos.. Gandules and white rice. What we got was orange rice and Gandules with pieces of steak on a plate.. \nSent it back and told her sandwiches. I told her what to put on the Jibarito, because she asked. We got two little separate sandwiches and the portions were all very un proportioned. Mexican workers, you can't get real Puerto Rican food from people who don't know the food. Not in this case anyhow.. And it was very overpriced for not being so great at all.. Also the orange rice was very salty... If you thought the food was good you haven't had the best yet to tell the difference ..\n"}, {"user_id": "Carlos R.", "rating": 4.0, "date": "2018-11-09", "text": "4 stars, great food, great service. Wife and I had empanada basket (shrimp and ground beef), arroz con granules, and 1/2 a jibarito (steak). All very good. Oh yeah, tostones too. Finally a good PR joint south of 290!! Passion fruit drink was very tasty too. Will return!\n"}, {"user_id": "Irene F.", "rating": 4.0, "date": "2018-05-13", "text": "Food was greasy , not the old grease never change the oil but , they could've skimmed some of the fat from the pernil juice and put my tostones on napkins but very flavorful . I had the jibarito and pernil . \n\nThe habichuelos had the Sazon flavor but overpowered by salt ! Rice was cooked perfectly white and the arroz con gandule was delicious . \n\nI ordered through Uber eats so I didn't dine in .\n"}, {"user_id": "Andrew V.", "rating": 5.0, "date": "2018-04-17", "text": "YO This place is AMAZIN. Ordered the pork and steak platters with the yellow rice and tostones AND sweet plantains. WOO Everything was straight fire. They don't play here. ALSO THEY GOT FLAN.\n\nPlenty of seating and the staff is pretty friendly.\n"}, {"user_id": "Dezarey P.", "rating": 5.0, "date": "2017-12-03", "text": "Roomie ordered the half Jibarito steak sandwich for 5.99 and I got the 2 empanadas and rice for 6.50 both were \nGo with the beef empanadas all the way! \nI got a veggie just to try out it was pretty good but not as good as the beef. Meat wins in this case ha! \n\nReasonably priced, cute inside and you automatically want to dance when you get inside\n"}, {"user_id": "Asad R.", "rating": 4.0, "date": "2017-10-08", "text": "This place has very good food at a great value - I definitely recommend you check it out! \nWe got the pork jibarito, beef and veggie empanadas, and the relleno. \n\nThe jibarito was great! It's basically a sandwich using crispy fried plantains as bread. It has a great flavor because they put some sort of garlic sauce on top. The meat was cooked perfectly and the portions were large - what more could you ask for? \n\nThe relleno was another standout, it's basically a fried potato ball filled with ground beef. It was so good! The flavors were awesome - to me, it's what I imagine a fried shepard's pie would taste like.\n\nThe only reason that I'm docking a star is because of the empanadas. They were good but not great. The flavors were lacking, and I feel there are many better empanada places in the city.\n\nOverall - I highly recommend you check this place out the next time you're in Pilsen!\n"}, {"user_id": "Dinah R.", "rating": 5.0, "date": "2017-10-29", "text": "OMG, I have not ever written or said anything like this about a Puerto Rican restaurant. It's been years I have been searching. The search is over.\n\nThis place is amazing!  Best jibarito I have ever had (at a restaurant of course, Grandma you are still number one chef in my book! )  \n\nWalking pass the restaurant the scent of heaven alerts your senses.  You have no choice but to \"stop\" in . The plantains were perfectly cut and fried till they were browned and tender. Sprinkled with pieces of garlic. Also it wasn't messy at all. Most the traditional Jibarito's, the plantains are long so when you cut them in half it falls apart making it messy and less appealing to eat. I am proud to say the jibaritos at \" jibarito stop\" was a taste of Puerto Rico. Great job ! \n\nP.S the rice and beans , and parcha were equally as good! ..\n\nBUEN PROVECHO\n"}, {"user_id": "Britney R.", "rating": 5.0, "date": "2018-03-13", "text": "I love this place. A local neighborhood spot I try to frequent as much as I can. I LOVE their shrimp empanadas - and I really don't say that often about empanadas! I fell in love right away before even trying their jibaritos - which are great too. The arroz con grandules are super tasty and you should always make sure to get the mayoket with anything you order. It's delicious. Only one critique here, it seems they've changed the batter for the empanadas recently - not a fan. The new batter is much thicker and takes away from the overall flavor of the empanada. I also felt like the shrimp was over cooked because of it. \n\nAll that aside, get here, try the food and support local business!\n"}, {"user_id": "SiSi H.", "rating": 4.0, "date": "2018-08-03", "text": "Today in Chicago we tried to but have a great meal at a Hispanic restaurant. This restaurant was an excellent choice. Although they messed up our order by giving us the wrong rice and beef instead of chicken and one of our sandwiches unless say that the empanadas were exquisite! The rice is just like it was supposed to be. Great choice for dining!\n"}, {"user_id": "Jessica F.", "rating": 4.0, "date": "2017-10-20", "text": "Empanadas are delicious! Jibarito sandwich was a bit greasy but filled with tasty garlic which brought all the flavors together!\n"}, {"user_id": "Theresa A.", "rating": 5.0, "date": "2018-04-08", "text": "Came for lunch one day with my girlfriend. It was delicious! The service is quick and friendly. We got the half jibarito and a side of arroz con gandules- DELICIOUS! We also sat by the window and it was so nice to be up there right next to the sun. Great lunch spot!\n"}, {"user_id": "Haley P.", "rating": 5.0, "date": "2018-09-17", "text": "If your craving jibaritos, this is definitely the place. The flavor and quality is top notch here, dont forget the empanadas! The price is very reasonable, great place for a quick bite.\n"}, {"user_id": "eddy d.", "rating": 5.0, "date": "2018-10-13", "text": "Food was delicious and fresh i got the steak jibarito good flavor tender steak and  good rice con condules i would 100 percent try this little spot out i will return\n"}, {"user_id": "Daniel B.", "rating": 5.0, "date": "2017-08-12", "text": "First time trying a Jibarito sandwich (fried plantains as the bread)....Amazing burst of flavors for the tastebuds. Very generous portions as well. We also ordered the fritter sampler, which was also very good, but we were nearly full just from the sandwich and accompanying rice/ham.\n\nPrice is very reasonable and the staff friendly. You can also byob,  so definitely recommend.\n"}, {"user_id": "Rita S.", "rating": 5.0, "date": "2017-06-24", "text": "This is my first time at The Jibarito Stop. I could not rate them with less than 5 stars!\nI ordered a large Jibarito Steak and Chihuahua cheese sandwich with rice and beans. It comes with 2 sandwiches and I could only eat 1 cause it is pretty substantial. The side of rice and beans are delicious! \nMy husband ordered 2 Carne y Queso empanadas, fried platanos e tostones.\nEverything is fried when you order which make everything taste 100x better!\nPrice is super fair! We spent ~U$18,00 for all that food plus a soda.\nI am absolutely coming back and recommending it to all my friends!\n"}, {"user_id": "Claire R.", "rating": 5.0, "date": "2018-09-02", "text": "This place is amazing! The flavors are spicy and layered but not too hot!  I should've been puerto rican!  Omg!  I'm in heaven! I have to earn to make empanadas like this!  Husband and I could not get enough! Everything... was amazing...jabrito steak sandwich is a must!\n"}, {"user_id": "Melissa C.", "rating": 5.0, "date": "2017-12-07", "text": "Bomb.com. Everything bursting with flavor. \n\nI was working so I had a couple people in tow with me. They never had Puerto Rican food before so I had to explain the menu to them. Two of us decided on the steak Jibarito and my other coworker got the shrimp empanadas. We all loved everything we ordered. My partner kept raving on and on and on about how good her food was , even moaning as she was eating! She told me she had a Puerto rican friend and she texted him to ask why had he never introduced her to Puerto Rican food before. The steak was juicy and tender and piled high, and the garlicky finish on top of the tostone was the perfect balance. For the Jibarito you are given a choice between chihuahua, American or pepper jack. The arroz con gandules that came with it was so good. My partners told me I can pick any restaurant I want from now on because they'd gladly like to try since I have good taste lol. So glad this was a winner amongst all 3 of us. Will definitely be back if I'm ever in the area again!\n"}, {"user_id": "Pranati M.", "rating": 4.0, "date": "2018-05-17", "text": "It was my first time here, so I got the dish they're named for - the Jibarito...it was great! I got the chicken and it was very juicy and flavorful! The BEST part of my visit was the green cilantro sauce..it was so fresh and flavorful...if you're looking for great value for your money check out this restaurant\n"}, {"user_id": "ezeh j.", "rating": 4.0, "date": "2018-11-18", "text": "So glad to finally have some good Puerto Rican food on the south side. Had a steak jibarito, relleno, tostones, vegetarian beans and rice. All were delicious, especially my papa relleno; crisp on the outside and moist on the inside.  I did find the tostones to be extra thick and wished my food had a little more flavor. A tad more garlic and salt would have made a difference. One last thing, this place is hardly noticeable from the street.  Drove by twice and double checked the address before making sure this dark place I was entering was not a bar.    Will definitely be back to try some other menu items.\n"}, {"user_id": "Jahayda Q.", "rating": 5.0, "date": "2017-10-08", "text": "Hands down the best jibarito I have ever had and I've had many. Thanks Yelp for helping me find this one as I have nothing worth visiting near me when I'm craving. \n\nEverything is freshly made and you definitely can taste the extra care in the food. It was delicious, service was quick and friendly, menu is small but what they make is made perfectly. Spot is clean and basic, no flares just perfectly done food. \n\nParking is a little rough but it's worth the time! Will definitely be coming back.\n"}, {"user_id": "Diana J.", "rating": 4.0, "date": "2018-08-09", "text": "My coworker suggested this place after I kept begging her for Puerto Rican rice. Everything is cooked after you order. Check the fridge before you order, they have Kola-Champagne and fresh made juice.\n"}, {"user_id": "Desiree R.", "rating": 5.0, "date": "2018-02-16", "text": "Highly recommend. This place is my standard. I can't get enough of them! I'm pretty sure I've tried ever single thing on their menu lol. I would recommend getting the Pork Jibarito w/ chihuahua cheese and their arroz con gandules. You also have to try the alcapurria.\n"}, {"user_id": "Noel R.", "rating": 5.0, "date": "2017-11-21", "text": "I've been here a few times now. The food is awesome.. Nelly greets with a Smile always. Thank You\n"}, {"user_id": "Louie N.", "rating": 5.0, "date": "2017-05-20", "text": "I decided to try this spot because it looked interesting and I love Puerto Rican food.  Nice vibe, clean, nicely decorated, great music playing.   Order taker was nice, ordering system was up to date.  I ordered the special, 1/2 jibarito steak sandwich with rice & beans which was fantastic.  Seasoned perfectly.  I also ordered plaintains & tostones which were good.  Also a shrimp empanada & a cheese one, both were fab though that shrimp one kicked butt.  I waited about 21 minutes for order so u may want to phone first if u don't want to wait.  Overall I was very impressed and will be back soon.\n"}, {"user_id": "Cary C.", "rating": 5.0, "date": "2017-05-31", "text": "Oh man I love me some jibaritos. I'm sorry that I butchered the pronunciation when I order them. \n\nThis place is no frills, just delicious jibaritos and empanadas. Great prices and the sandwiches come with a nice helping of tasty rice. \n\nThe meats are tender and flavorful without being too salty. The plantains are just right, nice crunch, some heft, and a nice coating of garlic butter. \n\nThe empanadas have a great combination of crispness, weight, and flavor. \n\nThey are friendly and the place has a laid back atmosphere. They close early so get there before their kitchen shuts down or you will miss out.\n"}, {"user_id": "Shuang Z.", "rating": 5.0, "date": "2016-07-23", "text": "Best Puerto Rican food ever!!! They have the authentic Jibarito sandwich served here, which is made with Plantains instead of bread. The pork one is awesome. you can choose your own cheese too!\nI tried the coco rico soda! It tates sooooo good and refreshing!!!! They also offer other authentic mexican drinks, which are worth checking out!!!\n"}, {"user_id": "Jason L.", "rating": 5.0, "date": "2018-07-21", "text": "I've been coming here since it opened. I'm surprised I didn't leave a review sooner. I love coming here, always great customer service and importantly great food! I love the jibarito sandwiches and since switching over to mostly a vegan lifestyle, I enjoy their vegan jibarito!\n"}, {"user_id": "Francisco M.", "rating": 4.0, "date": "2018-06-30", "text": "The food and service was so good. I didn't know rice like that existed and the jibarito did not disappoint. The only issue was that there was no AC so you can imagine how hot it was on a 100 degree day. I will surely come back and update this after I go back to eat and see that the AC is fixed.\n"}, {"user_id": "Jen V.", "rating": 5.0, "date": "2018-02-16", "text": "Best jibarito on the south side of Chicago !!!! I normally get a steak jibarito and a side of tostones . They always give you a good amount of juicy steak . The staff is super friendly . Would highly recommend!!!\n"}, {"user_id": "Sonali P.", "rating": 4.0, "date": "2018-06-26", "text": "My favorite part was the green sauce (cilantro and something delicious I can't remember right now) - well flavored and great addition to the meal. \n\nThe rice was good- slightly salty for my personal taste but generally well seasoned.\n\nThe jibarito was also well seasoned, especially complimented with the green sauce. Slightly dry. \n\nOverall a very pleasant experience! Good music and vibe.\n"}, {"user_id": "Leo G.", "rating": 5.0, "date": "2018-11-12", "text": "One of my favorites, very tasty and authentic place. I don't live near by but the food here and the bakery down the street are worth checking out on a regular basis.\n"}, {"user_id": "Alondra A.", "rating": 5.0, "date": "2018-07-25", "text": "I went to this place once on a date and it was absolutely the best and very affordable! That doesn't take away value from the food since it was so good, especially the jibaritos, arroz con gandules and shrimp empanadas. Definitely looking forward to going again!\n"}, {"user_id": "Robert C.", "rating": 3.0, "date": "2018-04-18", "text": "I have never had peurto rican food. so i cant tell you how authentic this place is or not. but there were many older hispanic ladies in the kitchen area which i can go ahead and assume that it is pretty authentic. i got myself a roasted pork plate with rice and tostones. the roasted pork was juicy and tender and melted in my mouth. delicious. the tostones were eh, which is probably why i gave this place a 3 star and not a 4. overall though very good! check them out!\n"}, {"user_id": "Miri A.", "rating": 5.0, "date": "2018-06-21", "text": "Found this spot and ordered my first Jibarito on Grub Hub. After about an hour, I wondered where my meal was. The restaurant said they were waiting for a driver still. After 1 1/2 hours, I called Grub Hub to inquire-they redispatched. The restaurant called me to tell me the food now was cold-and they didn't feel right serving it-they made me a whole new fresh meal and it was delivered ASAP. It was THE BEST FOOD EVER!! My hats off to the staff at The Jibarito Spot and their thoughtfulness to supporting their neighborhood and serving awesome food!! A must in Pilsen!!\n"}, {"user_id": "Claudia S.", "rating": 4.0, "date": "2017-01-27", "text": "I'm a proud halfie (of the Mexican and white persuasion), but when I'm not busy craving tacos or hamburgers, I want arroz con gandules.  Too bad I never paid any real attention when my bestie taught me how to make it.  To be fair, once she pulled out the homemade sofrito from her grandfather, the lesson was over.  I don't have a Puerto Rican abuelo to make me sofrito and while some people have no problem grabbing a jar from the store, it's just not the same.  \n\nAnyhow, I had known of this food truck, but never managed to catch it and when it was around, they had a long line and I had little patience.  Then, like music to my ears, I heard they were opening up shop in Pilsen.  Be still my heart!  It took awhile to actually try them, because they kept selling out and their hours didn't work with mine, but finally, I tried them.  I don't remember that overwhelming garlic smell the first time (but my breath sure did), but this second time?  Oooooh weeee!  We ordered delivery through GrubHub and I could smell it from the hallway.  \n\nDelicious, delicious garlic.  Split the steak and pork jibarito the first time around and I'm glad I was reminded that I preferred the pork, because once I ate it, I remembered just how tender and juicy it was.  You have 3 or 4 cheese options, though I don't mess with American because gross.  I recommend the chihuahua, but the pepper jack isn't a bad option either, just didn't have a noticeable taste on the sandwich.  I skip the mayo, because also gross.  Keeping that in mind, that means this must be a pretty good jibarito.  \n\nNow, here's where I know they're legit.  I don't give out compliments when it comes to arroz con gandules unless you're my friend's grandmother.  In fact, I've been known to text my friend and say \"tell her I'm eating at (insert restaurant) and their rice isn't as good\" and her response is \"jajaja, ay mija, gracias\" and thinks I'm super sweet.  Well, my friend lives on the north side and I heard grandma isn't making arroz as much these days, so The Jibarito Stop might just have to be where I get my fix.  We hadn't eaten all day and I was in charge of ordering, so this time around I also got a side of arroz blanco con habichuelas (also very good), one alcapurria (good, but should have used a sauce with it), one papa rellena (good, but definitely needed a sauce to help balance the ratio of potato with beef) and a side of pastelon.  I feel like they called it something else, but I can't find it on the menu and it was basically this, so pastelon it is.  I knew what it was, but had never tried it.  At first it was a little too sweet for my liking, but I let it sit for a bit and had it later and couldn't stop eating it.  The sweetness was balanced by the beef and I couldn't believe in the 22 years of knowing my friend AND going to Puerto Rico with her, I had never been introduced to this dish.  \n\nWe ordered a lot, because I was hungry and things sounded good, but it was worth it.  Don't do delivery if you can avoid it (it added around $10 to our bill), but definitely give The Jibarito Stop your business.\n"}, {"user_id": "Angela B.", "rating": 5.0, "date": "2017-01-17", "text": "I love this place! they use this amazing garlic sauce to cover everything so the food is incredibly flavorable. So far I've tried:\n\nShrimp empenadas--delicious, very fresh and have some potato including inside so it's also quite filling\n\nPernil--juicy and tender\n\nTostones--slathered in garlic, I could eat these all day (they're like french fries for the new world)\n\nChicken--also incredibly juicy and well seasoned\n\nArroz con gondules--this is the one thing I could leave...it's okay, something about it tastes like it's not homemade--not bad at all, just does not stand up to the rest of the menu\n\nRice and beans--not seasoned as heavily as I would like but it's still good.\n\nAlso, they have avocado! which I always order on the side, it's incredibly delicious. \n\nIf you're in Pilsen, this is definitely worth checking out. Some times my fiance and I trek across the city when we have a craving.\n"}, {"user_id": "Araceli E.", "rating": 5.0, "date": "2018-07-12", "text": "I absolutely love they're food!!!! I always get the meat and shrimp empanada with a side of arroz con gandules and some maduros. They never fail me, I've also had a Jibarito from there. I will continue ordering from there whenever I get a chance, I got all my coworkers hooked on they're food lol. No complaints here!\n"}, {"user_id": "Jordan L.", "rating": 5.0, "date": "2018-06-30", "text": "Everything here is very flavorful! And there are vegan plates for those that need them. Which are also delicious, and I'm not a vegan btw, but my wife is. Great portions as well. This is our go-to whenever we're in the Pilsen area.\n"}, {"user_id": "Emilie B.", "rating": 4.0, "date": "2017-10-13", "text": "I live in the neighborhood and have eaten here a few times now. On my most recent visit I had an alcupurria and the half order of a pork jibarito with arroz con andules. Since I ordered through the Yelp Eat 24 service, the guy behind the counter knew and even called me by name when I picked it up.  Each time I've been there the service has been courteous and the food is delicious. It's quickly becoming a neighborhood staple and is a good alternative to the numerous taco and other Mexican food options.\n"}, {"user_id": "Sam S.", "rating": 1.0, "date": "2018-03-10", "text": "The Jibarito plantain (the \"bun\" for the sandwich) was REALLY HARD. They completely messed up my order. (wrong meat, wrong cheese). It was an obnoxiously long wait for my to go order. People who ordered after me were seated and served before me. They said they would rectify the situation by issuing a refund. They never issued the refund. \n\nI attempted to give them another try. I ordered sweet plantains. The order was skimpy. The plantains were dry, thick, and hard.\n"}, {"user_id": "Lauren W.", "rating": 5.0, "date": "2017-09-19", "text": "By far the best sweet plantains I've had in the city so far! The chicken dinner plate is so juicy and full of sensational favor. Must have more!\n"}, {"user_id": "Elia A.", "rating": 5.0, "date": "2017-07-20", "text": "I heard about the jibaritos and finally got a chance to go. Service was great cashier was very friendly. Place was clean and our food was very good. We got the half jibarito one pork with white rice and beans. My friend had one of chicken and arroz con gandules. We were very happy with our choices and filled us up.\n"}, {"user_id": "Na S.", "rating": 5.0, "date": "2017-06-30", "text": "So good. Made fresh every time. We could never finish a whole order so we usually get half jibarito with a few empanadas. Everything is absolutely delicious. The veggie jibarito is amazing. Great spot with casual seating. Free parking on 16th street if you have time to drive around. Or else there's usually lots of street parking in the front. Very convenient.\n"}, {"user_id": "Sabrina C.", "rating": 5.0, "date": "2016-10-24", "text": "I'm kinda on a mission. Well it's one of my food missions: Find the best Jibarito in Chicago.\n\nJibarito Stop has thus far, been my favorite and BELIEVE ME, I've been getting around! ;-)\n\nThe menu focuses on jibaritos and empandas. I, of course, went for my favorite and got a chicken jibarito and Arroz con habichuelas (white rice and beans). One huge problem I normally have with jibaritos is that the chicken is just cooked and slapped on, sometimes without being seasoned well or cut where you actually can enjoy it and you're too busy tearing into this chew toy than actually enjoying it. Not the case here. The meat is seasoned well and the sandwich is cut into manageable pieces. I also tried the shimp empanda...... well slap 10 pounds on me and call me obese; it was amazing!!!! Washed down with a Cola Champagne, I felt like I was in PR all over again. As I often do..... even in bed. :-)\n\nFeel free to call ahead and have your order waiting, however even if you stop in, your wait won't be that long.\n\nBuen Provecho!\n"}, {"user_id": "Teresa M.", "rating": 5.0, "date": "2018-03-10", "text": "Let me say that I am Puerto Rican, I know what PR food should taste like and this place definitely does deliver on the authentic flavor of PR cuisine.\n\nEverything here is delicious. I love that I have a place in the city I can go to for a jibarito sandwich without having to go to the North side. Actually, this place has the best Jibaritos I've ever had.\n"}, {"user_id": "Pat P.", "rating": 5.0, "date": "2018-03-15", "text": "The jibaritos here are so good that I fantasize about eating one every week at work. It has the perfect crunchiness paired with fresh ingredients and tender meats. If I lived closer I would be stopping in all the time. When ever I have a bad day, I contemplate driving to the city for this because it would melt my problems away with each bite.\n"}, {"user_id": "Roger R.", "rating": 5.0, "date": "2017-06-18", "text": "I heard about this restaurant browsing the Internet. Since I love Puerto Rican food, I decided to take the long drive to Chicago to try them out. The place was not hard to find with GPS but beware, make sure you feed the meter. The ticket scoundrels are out in full force writing parking tickets. Anyway, the place was clean and was modeled like a fast food lunch shop. The menu was limited but it had some of my favorites so I was good. I ordered the empanadas or pastillos and wow they were really good. Also ordered arroz con gandules and I was a little disappointed. This main dish you have to make it right and I felt it was bland. The Maduros I ordered was also delicious so they got two out of three right so because of that I will try again to revisit the rice another time. If it tastes better the next time I will change my rating to add another star or two. \n\n*****updated\n\nSo I'm back. Wanted to try the arroz con gandulas to see if it was made right. Well, to my delight it was spot on today. Wow! Absolutely loved it. As promised I updated the Stars.\n"}, {"user_id": "Mariela R.", "rating": 5.0, "date": "2018-08-24", "text": "I've been here a couple times and I love it. The steak Jibarito is my personal favorite, my husband gets the pork and he enjoys it. The food is good and reasonably priced. I just wished they had more comfortable chairs.\n"}, {"user_id": "Oscar S.", "rating": 5.0, "date": "2017-04-29", "text": "Finally made the trip to Pilsen to check out The Jibarito Stop.I wasn't disappointed.The papa rellena was PERFECT.Love the fact that they have my FAVORITE hot sauce right at the tables as well.I usually have to bring my own bottle when I go to restaurants.Not here.They have the Yucateco already waiting for me!!!! NICE!! Also the fact that theyre BYOB scores them extra points.The food is DELICIOUS!!! Plenty if garlic in the jibaritos just the way I like them.Tried their tembleque for dessert and I was in absolute HEAVEN.I will for sure be visiting them again.Theres a liquor store just west of them near the pink line stop that sells alcohol so wining and dining is pretty simple.Glad I finally made it out there.Totally recommend!!! Im looking forward to trying out the whole menu.The prices are very reasonable.I ate like a king for about $16.I eat ALOT.lol.I was expecting to pay just over $20 but NOPE.Sweeeeet!!\n"}, {"user_id": "Lauren D.", "rating": 5.0, "date": "2017-05-07", "text": "Best goddamned jibarito in Chicago. And yes, I live right by Humboldt Park in the middle of a mess of Puerto Rican restaurants; and no, none of them are as good as the Jibarito Stop; and yes, I am aware of the irony of the best jibarito place in town being in a predominantly Mexican neighborhood. \n\nThe Jibarito Stop offers variations on the classic, including chicken, pork, and veggie versions and the option of chihuahua or pepper jack cheese. I am however fiercely loyal to the Chicago original: steak, onions, American cheese, lettuce, tomato, and copious amounts of mayonnaise. I deeply appreciate the way the flattened and fried plantain \"bread\" here is always crispy, never limp; I appreciate as well the way they serve the jibaritos on two petite rounds as opposed to the standard larger and more unwieldy whole flattened plantains. \n\nHave I mentioned that I'm a tremendous Plantain Slut? And oh my LARD the maduros here are so good. Crispy, sweet black edges, just like how Mama likes 'em. Skipping a side order of these would be unthinkable. \n\nDoes it get better? Of course it does: the yellow rice and pigeon peas here are not some starchy afterthought, but a delight all on their own: cooked to a perfect chew and spiked with salty bits of bacon. On a single occasion I was able to persuade myself to try something else and get the empanadas, and they were also delectable. \n\nI brought a visiting friend here for her first jibarito; the next night, she requested that we come back. They're just that good, tricks. Plus the lady working the counter not only recognized us, but thanked us for coming back, and who even does that?!\n"}, {"user_id": "Erica J.", "rating": 5.0, "date": "2018-02-24", "text": "So delicious and huge portions.\nThe staff are extremely friendly and welcoming! \nGreat prices too! \nSo happy they came to the neighborhood!\n"}, {"user_id": "Reina A.", "rating": 5.0, "date": "2016-07-01", "text": "1. It's a puerto rican restaurant so I am a bit biased BUT even if I wasn't a PR Id still give this spot FIVE HUGE STARS. \n\nGreat store, very simple yet authentic with culture on the walls. They make the food fresh andnyou csn see them cooking. The young lady that took my order was polite, patient and professional. I waited about 10 minutes for my food. \n\nI had the bistec jibarito y arroz con gandules soooooo good. Loved the arroz! The tostones was cooked perfectly. They had PR pops/soda as well so I had my coco ricooooo. It was just an amazing tasty experience. The steak was tender and they cheese was oooeygooey. Very good. \n\nMy husband isn't PR so I'd love to take him here to try it out. I went on a thursday afternoon around 12pm. It was kind of busy so Id certainly order ahead next time. :)\n"}, {"user_id": "Gloria T.", "rating": 5.0, "date": "2017-06-29", "text": "A little piece of Puerto Rico (heaven) in this hole in the wall joint. The staff was super nice and you could really tell they put their heart and soul into the business. Since my mom is Puerto Rican, I have some pretty high standards when it comes to jibaritos and these ones do not disappoint. Lots of meat options to choose from so you could never get tired of going to this place. Can't wait to come back when I'm in Chi town again.\n"}, {"user_id": "Elisa O.", "rating": 5.0, "date": "2017-11-08", "text": "Absolutely delicious!!! We ordered as an office a few different things to try out and everything was soooooooo good! We are so happy to have authentic PR food so close to us! No need to drive up north anymore. Highly recommend it!\n"}, {"user_id": "Mark G.", "rating": 4.0, "date": "2016-04-16", "text": "The jibarito is a food that has engaged me since I started this Yelp sh*t back in '08. Ya know, back before they gave ROTD & elite status to these alleged speakers of English who don't spell out the entire word \"you.\" Yeah, I just thew a ton of shade. One last time, you got bodied by a Yelpin' jigga.\n\nI hadn't had The Jibarito Stop when they were just a food truck, so other than simply knowing what the hell a jibarito is, I wasn't sure what to expect. I just knew having a Puerto Rican place in Pilsen was cool. For those of you who don't understand the significance of that statement, this is Puerto Rican food in a largely Mexican (at least for now) 'hood. They are not the same. It's sad I have to explain that to your unworldly ass. \n\nSoon as I got to the crib with the food, they already passed the Puerto Rican cuisine litmus test. I could smell the garlic before taking the food out of the bag. This is a good thing. If you have something against garlic, f**k your two cents unless it's going toward the bill. After almost maiming my mouth by a toothpick I didn't realize was holding the sandwich together because it was camouflaged by the plantain, I realized the taste was definitely there. I enjoyed half a steak and pernil (lechón) jibarito. The steak was just fine, but the pernil was Jesus H. f**k good. It's the best lechón I've had, no lie. I like that you can chose between 3 different cheeses, because something about melted yellow American cheese on Latin cuisine irks me. I opted for chihuahua, because why wouldn't I? Pepper jack was tempting though. \n\nThe inside of this joint is aesthetically nice, but slightly odd. It's got this very modern feel with just a touch of Latin. It's pretty indicative of Pilsen now. Yanno, \"I'm white but I totes moved here because culture...but not too much culture. I come from money.\"\n\nI'm still bias toward my jibarito spot on Western and Fullerton, but I'll be damned if this dark-horse of a Puerto Rican joint on 18th st. isn't up there with the best of 'em. Them closing early during the early part of their launch, laziness, and being a creature of habit is what took me so long to try them out, but I'm glad I finally did. \n\nIf you're on the north side, stay where you are. You're probably annoying anyway. If you're on the south side and want Puerto Rican food, here you go. Get you some.\n"}, {"user_id": "Jamie L.", "rating": 5.0, "date": "2018-02-21", "text": "Really good Jibarito sandwich!!! Love all the flavors and very nice service!! Will definitely come back!!\n"}, {"user_id": "Nohemi Z.", "rating": 5.0, "date": "2018-02-10", "text": "When I moved to Pilsen from Humboldt Park I was missing Puerto Rican food so much, I was so ecstatic when I heard this place was opening up! I've been here so many times and they never disappoint. My favorite part about this place is the staff! Every time they manage to make me smile! I love their Jibaritos! I usually like my arroz con gandules greasier but it's not bad either! So happy your here in Pilsen!\n"}, {"user_id": "Danny M.", "rating": 4.0, "date": "2016-07-06", "text": "I use to crave jibarito every time and would drive up north just to fulfill my cravings. However, this place is so close that I no longer have to fight the traffic and go up north. Located in the heart of Pilsen, this place have amazing Steak Jibarito. The flavor is there, but the meat is a little on the dry side. This place is really good, but I would have to say that my favorite Jibarito spot is still up north. I also got the beef and cheese empanada and it was delicious.\n"}, {"user_id": "Ivan K.", "rating": 4.0, "date": "2017-02-27", "text": "If you haven't tried Jibarito-style sandwiches/tortas, this is a good place to hit up. They basically replace the usual torta bread with plantain patties. I had the vegetarian option, which I somewhat regret. It was acceptable- the vegetables were tasty, but there was definitely something missing. At places like this it's hard to ignore that meats are the star of the show, so omitting them makes a big difference. I think it's great they have a vegetarian option, but think they could do better. Maybe try adding mushrooms, or cooked sweet plantains? Both?? Pickled vegetables would've worked too. \n\nOther than that it was great though, so if you're not vegetarian I think you'll enjoy this place.\n"}, {"user_id": "Kayvan T.", "rating": 1.0, "date": "2018-07-07", "text": "Let me keep this simple, if you're from a Latin Caribbean country and are looking for an authentic meal..the flavor of food is so unauthentic it is practically robbery. STEER CLEAR.\n"}, {"user_id": "Darren F.", "rating": 4.0, "date": "2016-04-07", "text": "me and a coworker was talking about food 1 day and he asked me if i like PR food.. and after i said yes and asked him if he know of a good place, he recommended this spot..\nI ended up going right after work since it wasn't far from me..\nI ordered the steak sandwich.. 2 chicken and 2 beef and cheese empenadas..\nthe steak sandwich came with rice.. if I recall, u have a couple options of the type of rice you want.. I chose the pigeon rice.. the steak sandwich was good.. oily but good! \nthe empenadas was also tasty.. they didn't not cheap out on the ingredients.. well packed empenadas..\nwould definitely come back here again!\n"}, {"user_id": "Ryne D.", "rating": 5.0, "date": "2016-03-21", "text": "This review is for the B&M spot, not their former food truck - kind of weird that it's not separate, but it's the same food I assume.\n\nFinally finally finally, I can get jibaritos without having to hop on the train all the way to Humboldt Park (though the train to Pilsen is almost the same length of time). For those who don't know, a jibarito is a sandwich with meat (usually steak, can be pork or chicken), cheese, lettuce, tomato, and garlic mayo. The big game changer is it uses plantains instead of bread, which is sturdier than bread and provides a satisfying break when you bite into it. It's an original of the Chicago Puerto Rican community.\n\nMy first jibarito experience was at the Taste of Chicago, so obviously I've started at the bottom and worked my way up. While Pilsen is more Mexican while Humboldt is Puerto Rican, the jibarito holds up well in unfamiliar territory. Most jibaritos I've had have been overly greasy, and hard to manage. Here they're not greasy at all and are wisely pre-cut in half. I'm still not sure if I liked the steak or pork better because both were great. Also, the arroz con gandules (yellow rice with peas and ham) is a definite must.\n\nWhile it seems they've retired their food truck, they've gone from a place you hunt down to a must-visit shop. This is one place I'm going to start bringing out of town friends besides the obligatory Portillo's and Lou's.\n"}, {"user_id": "Laverne A.", "rating": 5.0, "date": "2016-03-19", "text": "A few month ago the Pink line was all messed up. I met a young lady and we started talking about work. Because of the trains snafu it looked like she was going to be late for her new job. \nShe worked/works at The Jibarito Shop. I told her I would stop by, well today is that day. \nOnce you get off the Pink line at 18th go left one block. The restaurant is about 400 feet from the corner of Paulina. \n\nThe space and large comfortable and clean. As soon as you walk in you are greeted by a handsome gentleman whose customer service skills heck or maybe his looks melted my heart. They have intentions on the wall for those not sure what or how to order. \n\nI ordered the Steak Jibarito w/ chihuahua cheese, yellow rice and gondolas. $8.99 and a side of sweet plantains $1.75. You see my picture of my food, $11 and I know I'll have some leftover for dinner. The steak is tender and seasoned very well. The garlic oil on the jibarito is just enough. I wish I had asked about the rice, I don't eat pork and it look like I have pieces of bacon in my rice. \n\nI received my order in under 15 mins and once again I was serviced by  mister handsome. As I gathered my items to leave a women was at the counter with a big smile she said \"thank you\" how refreshing to receive that type of customer service today. This is a place I don't mind spending my money and I plan to have my book club monthly meeting there. \n\nEverything was outstanding, Jibarito shop thank you for making my Saturday\n"}, {"user_id": "Mimi W.", "rating": 5.0, "date": "2017-11-30", "text": "Thank you for putting this place on the south side. Now I dont have to travel all the way to Humboldt park when Im craving a jibarto sandwich. Food was delicious. Customer service waa great!  Love the idea of being able to purchase a half jibarto.... will definitely be back\n"}, {"user_id": "Amina K.", "rating": 5.0, "date": "2017-11-08", "text": "Okay, these jibaritos are out of this world. I stopped in a while back when a Puerto Rican food craving hit me. Ordered the bistec jibarito and arroz con gandules. The plantains were fried to crispy perfection and covered buttery, garlicky deliciousness. My mouth is watering just thinking about it. The half order is probably enough for one person. Pretty affordable and staff is really nice, too! Will definitely be coming back here!!\n"}, {"user_id": "Eliana C.", "rating": 5.0, "date": "2017-02-08", "text": "I really hope the quality of the food stays this good! After being disappointed several times over the years with what used to be our fave PR restaurant in Humboldt Park, a friend recommended this spot. Living in the NW Suburbs, Pilsen is easier for us to get to then HP, so we gave it a shot one chilly Sunday afternoon. \n\nWe ordered steak jibaritos with Chihuahua Cheese. Husband ordered his with arroz con gandules, I had white rice and beans. I wish I would have gone with the arroz con gandules also, much more flavorful than my rice and beans, and I have never been a big fan of arroz con gandules.\n\nThe jibaritos lived up to the hype, they were soooo delicious and hot and flavorful! I loved that you get two small ones, there was great meat to plantain ratio. \n\nAlso ordered the sweet plantains, so delicious and perfectly sweet! Had to get a second order! He ordered an alcapurria, he loved it, we both agreed it was better than we had in Puerto Rico. \n\nWe can't wait to go back! Everything was on point, made to order, fresh and delicious.\n"}, {"user_id": "Lauren H.", "rating": 4.0, "date": "2016-06-14", "text": "Puerto Rican in Pilsen?! I'm there! Just happened to be in the area and while I already thought I would stop for carnitas, I found this place on Yelp and opted for the \"other\" roast pork. Pernil is one of my favorite dishes and I ordered it sandwiched between fried plantains. You get a couple options to choose from here like type of cheese (American, chihuahua, or pepper jack) and rices (white with stewed kidney beans or yellow with pigeon peas). Not usually one for experimenting with my jibarito, I went out there and tried the pepper jack. It had a really creamy melt and a little pepper flavor, but I probably won't order cheese at all next time. \nThe pernil was tasty and juicy. Sometimes it can be salty or dry, but I wasn't disappointed. They also managed to crank it out pretty quickly-24 minutes on my meter were enough to sit and eat. \nI kept a star because the plantain was a little soft for my taste. I prefer my to stones to be pretty crispy. \nSome tips: if you're not into garlic make sure you tell them no mojo on the sandwich, it is covered in it.\nThere is pork in the arroz con gandules. \nGo really Puerto Rico and try the coco rico or Kola champagne with your meal.\n"}, {"user_id": "Alexandria M.", "rating": 5.0, "date": "2017-10-30", "text": "Authentic Puerto Rican food at it's best! I travel a lot to Puerto Rico for work and have tried to find places in Chicago that have good Puerto Rican food and the Jibarito Stop is the place! Good food and good service you can't go wrong! The prices especially make it worth it!\n"}, {"user_id": "Jamie H.", "rating": 5.0, "date": "2015-12-29", "text": "Came by today randomly as I was walking by the place and ready for lunch. I had totally forgotten about this place, but it was one I had been wanting to try. I went with the steak jibarito sandwich with queso chihuahua. It said \"breadless\" so I was interested to see what the sandwich was going to be like....they had fried plantains as the bread. The sandwich and extra sauce was excellent! I'm not a big rice person, so I asked if I could substitute the rice it came with for sweet plantains instead and they did it no problem. \n\nI was told it'd be about 15 minutes because there were a few orders before mine; it was really only about five minutes so that was a pleasant surprise! I will totally come back and bring friends as well. Great lunch spot!\n"}, {"user_id": "Michael S.", "rating": 4.0, "date": "2017-03-29", "text": "Great food & customer service if I need my quick or fix it's a train ride away just don't care about the tables other then that a must.\n"}, {"user_id": "Viv M.", "rating": 5.0, "date": "2017-08-14", "text": "OMG I want to eat here all the time, every day! Try the steak jibarito with rice and beans on the side. The amarillos (sweet plantains) are also delish. They have classic Puerto Rican sodas like Coco Rico and Cola Champagne (super sweet, but also very nostalgic). Next time, I will try the alcapurria. It's perfect for pickup/delivery. If you want to dine in, expect a very casual, almost no frills atmosphere. Street parking is available, but metered. You could also take the pink line to 18th street, and walk about half a block east to get here. See you there!\n"}, {"user_id": "Madeleine H.", "rating": 3.0, "date": "2017-09-22", "text": "Great idea to use a fried plantain in place of bread. Unfortunately it was a miss for me as despite my request for the steak to be medium rare, it was medium well to well done. In my book that's overdone and consequently inedible. Had I not gotten take out I'd have requested a do over.\n"}, {"user_id": "John S.", "rating": 5.0, "date": "2017-11-16", "text": "I don't typically write reviews but this place is fantastic. Amazing food, nice staff, very reasonable prices and great atmosphere (good music, not too loud, comfortable seats/tables).\n"}, {"user_id": "B G.", "rating": 5.0, "date": "2017-05-09", "text": "This was my first time here. I wasn't too sure about the sandwiches when I saw the pictures. I thought the outside was going to be hard. I am totally amazed at how delicious the vegetarian sandwich was. I wanted to buy a second to go. I also tried the sweet plantains, delicious. I will definitely continue to come back. The garlic topping is the bomb!!!!!\n"}, {"user_id": "Emily H.", "rating": 5.0, "date": "2017-01-06", "text": "the quality of the food is just awesome, we loved everything we ordered.\n\ni ordered a jibarito sandwich with roasted pork, really liked the sandwich made from fried plantain and the hint of garlic, the roasted pork is very tasty and full of flavour! the arroz con gandules (yellow rice?) is really good too\n\nmy friend got the steak/onion platter, the portion is pretty big and the steak is well cooked and not too tough either\n\nwe also ordered the tumbleque as our dessert, really liked this coconut pudding\n"}, {"user_id": "Ali E.", "rating": 5.0, "date": "2017-10-15", "text": "The decoration and feel of the place is spot on! From the music to the tables and chairs to the murals this place brings a great puertorican vibe. I got the jibarito since I had never had it and it was delicious. It's a pork sandwich with fried plantains instead of bread. It came with puertorican rice which was also good but a tad bit on the salty side. They were brand new when we visited and you could tell. We didn't get our utensils until several minutes after our food was served leaving us to wait for them to remember. Our server was very friendly and they apologized for making us wait. Our meal was very pleasant and she even wrote a handwritten thank you on our receipt when we left.\n"}, {"user_id": "Talibah M.", "rating": 5.0, "date": "2017-08-12", "text": "I really enjoyed the food here. I got the vegetarian jibarito and my girlfriend got the beef. She said the beef was tender and tasty. The veggie one was also flavored well. My favorite part of the meal was the beans and rice. The staff was nice and the seating was comfortable. The prices are fair and I will definitely go back when I'm in the area.\n"}, {"user_id": "Diana V.", "rating": 5.0, "date": "2017-10-13", "text": "I really wasn't a fan of jibaritos, until this place. Steak jibarito with American cheese yumms!\n"}, {"user_id": "Looney T.", "rating": 5.0, "date": "2017-10-25", "text": "Oh my god!  This place is great!  I am from San Diego and thought I would try Puerto Rican food for the first time.  It was amazing!\n\nI have since been looking for a Puerto Rican restaurant in San Diego.  I have found nothing that compares to the Jibarito Stop!  I will go back every time I am in Chicago!\n"}, {"user_id": "David S.", "rating": 5.0, "date": "2015-10-27", "text": "Reasonably priced.  New and clean inside.  BYOB.  I have a Puerto Rican friend and he said the food was excellent and authentic.  I thought the steak jibarito was extremely fresh tasting and was a load of food for the money.  Nice blend of tender steak, onions and garlic and I topped it with the garlic oil because I can;t eat enough garlic!!!  Try the yellow rice and pigeon peas as a side but definitely get the meat stuffed taters too!!!\n"}, {"user_id": "John H.", "rating": 1.0, "date": "2018-07-24", "text": "I live near Humboldt Park so I don't have to go far for good Puerto Rican food, but I saw a video about this place and I'm in Pilsen enough to where I thought I'd give this a try.  My mistake.  Growing up eating jibaritos and a plethora of Borinqueña delights I had certain expectations.  Those expectations were not met in any way, shape, or form.  I feel like what they are serving is a perverted interpretation of what Puerto Rican food is.  The habichuelas had far too much cilantro in them and the wrong flavor profile.  The fact that they make the tostones for the sandwich in circles should have been a clue that something was wrong.  The steak and chicken for the jibaritos were boiled and flavorless. The steak was seasoned well, but in the end it was just boiled salted steak.  Jibaritos truly shine when the meat is ROASTED/GRILLED.  Traditionally the mojo, or garlic sauce, is always made with raw garlic.  The mojo sauce on the jibaritos we ordered tasted like sweet roasted garlic and was PINK!?  The arroz con gandules was terrible, it tasted too much like smoked ham, you could taste nothing but smoked pork and not in a good way.  The maduro wasn't cooked all the way.  The other fried offerings were completely off and tasted nothing like Puerto Rican food.  We also got the empanadas.  Note to self, Puerto Ricans don't make vegetable empanadas for a reason.  The beef empanada was actually not bad, probably the best thing we had from there.  The shrimp empanadas were a serious let down especially considering the up charge and the fact that they were unseasoned and filled with potatoes.  YES!  THAT'S RIGHT!  Shrimp empanadas with POTATOES in them, smh.  Why charge more for a potato empanada with shrimp seasoning, that's disrespectful.  The sauces were terrible, not even worth the time it would take to break it down.  I can understand why someone who has never had any Puerto Rican food or an Jibarito before would think this is good, but anyone, and I mean ANYONE that has ever had a real Jibarito would be disappointed in the offering from this restaurant.  This is Puerto Rican food for the uninitiated.  If you closed your eyes and ate this you would think you were at a bad Mexican restaurant, which may not be too far off from the truth.  They get 1 star for pretending to be something they're not, which is a Puerto Rican Restaurant.  They need to make the trek up to Humboldt Park for a learning experience and then adjust their menu and execution accordingly.  This place is aptly named The Jibarito Stop, as in \"Please STOP making Jibaritos this way!\"\n"}, {"user_id": "Jose J.", "rating": 3.0, "date": "2017-07-25", "text": "Overall the food was good not all the buzzt I thought it would be. North side is still better\n"}, {"user_id": "Maria H.", "rating": 5.0, "date": "2017-09-29", "text": "Today i had the best jibarito plate ever. the arroz con gandules was perfect and none grease.\n"}, {"user_id": "Cj L.", "rating": 5.0, "date": "2017-06-12", "text": "Wow. The large jibarito itself is enough to suffice.  I walked in on a mid Saturday afternoon.  The restaurant was not to busy but still had several tables occupied. I scanned the menu and realized the most obvious choice was the steak jibarito.  The staff was friendly and helpful.  After a little bit, I chowed down on an excellent sandwich and forced fed myself the garlic plantains.  Honestly, I was happy all around with my meal.  My only regret was over ordering.  The music could be a little lower to allow for customers to clearly hear each other but, I would easily return\n"}, {"user_id": "Cee O.", "rating": 5.0, "date": "2017-07-22", "text": "I was in need of lunch so I went on Eat24. I've been wanting pr food for a while so I figured why not give them a try.. They are a very friendly staff and the food was greatttt! I will say I got full pretty quick with the papa rellena and arroz  but it was worth the sleep coma at the end . I definitely will be back!!\n"}, {"user_id": "Daniel R.", "rating": 4.0, "date": "2017-07-19", "text": "Great spot. Minimal menu. I always get the steak jibarrito. Staff is always welcoming.  It is good enough for pilsen. Nothing like division street though.\n"}, {"user_id": "Cody K.", "rating": 5.0, "date": "2017-08-19", "text": "Fantastic spot. I had a monstrous appetite coming in, and the grande steak sandwich with arroz con gandules rice was plenty. Friendly, attentive staff and a clean space. The meat was greasier than I prefer, but not enough to detract from the rating.\n"}, {"user_id": "L L.", "rating": 5.0, "date": "2016-09-03", "text": "The simple Puerto Rican dishes are fantastic. We had steak with onions platter served with yellow rice/peas, sautéed chicken breast with white rice/beans platter and jibarito sandwich of slow roasted pork shoulder with lettuce, tomato, mayo, garlic sauce between two pieces of plaintains. Platters each had plaintains as free sides. I rarely drink sodas, but tried the coconut soda which was not very sweet and delicious. Service was friendly and quick. I'll be back soon for more steak with onions!\n"}, {"user_id": "Rachel R.", "rating": 5.0, "date": "2016-06-08", "text": "I used to go out to Humboldt Park for my fix of Puerto Rican food, but this little Pilsen gem has stolen my heart. The jibaritos are perfect, the arroz con gandules and alcapurrias taste just like my family's recipes. The staff is always friendly, the music is a plus, and the neighborhood is beautiful. \n\nThis is my new favorite, I recommend it to anyone looking for a delicious meal.\n"}, {"user_id": "Andre B.", "rating": 5.0, "date": "2017-07-30", "text": "Had the pork Jibarito, half with arroz con Gandules. Fantastic and well seasoned. Will be back\n"}, {"user_id": "Veronica T.", "rating": 5.0, "date": "2016-06-26", "text": "First time coming here. Wow was so amazed how much flavor and how fresh the food was. The people that work there are nice and together. \nWe order jibato de lechon. Comes with mayo, tomato, garlic, lettuce. Side is rice choice of spanish or white rice and beans. Was so good warm and flavor is off the chain.\nAcapudia was less greased then other spots which is a plus. And was flavored to my stomachs love.\n\nMe and my bf are in luv with ur spot and can't wait to taste more of ur food.\n"}, {"user_id": "Richelle T.", "rating": 4.0, "date": "2017-06-09", "text": "Very picky with my Puerto Rican food but, I must admit their jibarito sandwiches were sooo good and the lechon con arroz.  Will definitely go back again!\n"}, {"user_id": "Rachel R.", "rating": 5.0, "date": "2016-03-23", "text": "Yup! Still delicious! This place has continued to expand their hours (now open until 8 p.m.) and make great food. The pernil jibarito is my number one go-to; I would bathe in that garlic oil, if anyone would ever come near me again. Good food for a good price, fast takeout, and hits the spot for a quick and tasty Puerto Rican meal.\n"}, {"user_id": "Christina D.", "rating": 5.0, "date": "2017-06-26", "text": "I had the chicken and steak jibarito. It was amazing. I ordered to go on a Friday afternoon. Only took about 15 minutes. The food was great! I will be back again.\n"}, {"user_id": "Kenya C.", "rating": 5.0, "date": "2016-09-10", "text": "Been a fan since their food truck, however the food taste better in the restaurant (fresh). Every-time Im in the area its a must that I stop by. Restaurant is nice, roomy, clean, customer service is great. Overall.... food is amazing!!!!\n"}, {"user_id": "Victor R.", "rating": 5.0, "date": "2016-08-21", "text": "Hands down. My favorite Puerto Rican restaurant in Chicago. Staff is super sweet and great portions and ITS NOT GREASY. Take it from me, a true Chicago Rican - great place! And don't forget a slice of flan! It goes quickly - get it when you can!!\n"}, {"user_id": "V. Vianey V.", "rating": 4.0, "date": "2016-04-14", "text": "Food was really good. I wish the plantains were fresh. I make jibaritos all the time so I could tell. I still loved it though. I think it will take a lot for me to hate a jibarito. Haha. Rice was good too. I enjoyed my food very much. Still very new so I know it will only improve from here on out. Best of luck! :)\n"}, {"user_id": "Nineveh O.", "rating": 4.0, "date": "2017-03-16", "text": "Stopped in during a small break from work. I got the chicken jibarito. The quality was great and it was very satisfying. Chicken and rice were very flavorful. I would definitely come back here again to try something else they have. Place was set up like a fast good joint  and the food did come out fast. Street parking outside.\n"}, {"user_id": "Monica E.", "rating": 2.0, "date": "2017-12-21", "text": "Ordered to go and was disappointed how little food they give you for the price you pay. Food was flavorful, don't get me wrong but had better on the north side (Jibarito y mas- a must go to place for Puerto Rican food) I hope they just up-the portions on rice especially and lower those prices on accapurias ($2.25 is unheard of)\n"}, {"user_id": "Jennifer K.", "rating": 5.0, "date": "2017-05-10", "text": "The food here is delicious!!! It's very flavorful and the portion sizes/prices are perfect. The staff are friendly and always play great music.\n"}, {"user_id": "Delightful D.", "rating": 4.0, "date": "2017-02-10", "text": "Four stars all for food the restaurant is pretty basic and they don't serve alcohol but the food is amazing. I'm Puerto Rican so I know it is hard to find good spots in the Chicago area. The pork and steak jibarito is bomb and everything else I tried potato salad, empanadas and rice and beans was well seasoned and enjoyable. I'm so glad this is close to home I will be returning soon! Fast and friendly service by some wonderful boriqua staff thank you guys!\n"}, {"user_id": "Gabriella C.", "rating": 5.0, "date": "2017-04-15", "text": "Best Puerto Rican food in Chicago!! My boyfriend is Puerto Rican and from NYC so it's kinda hard to come across some authentic, delicious tasting PR food.. said it's the best food he's ever eaten. Will go here time and time again. I choose this over any other place hands down. Thank you so much for such great food.\n"}, {"user_id": "Cornelia A.", "rating": 5.0, "date": "2016-09-01", "text": "Best dang steak jibarito in the city hands down!!! You have a fan for life.. Service was great, price was even better!\n"}, {"user_id": "Elizabeth B.", "rating": 5.0, "date": "2016-04-30", "text": "Living in Hyde Park you don't have any Puerto Rican restaurants in the area. Moving away from family, I really missed Puerto Rican food. Grub Hub changed that, and my boyfriend and I ordered a couple of hours ago. Let me tell you, the food was absolutely delicious! \n\nBeef empanadas were cooked to perfection, the papa rellenas were mouth drooling and the jibarito meat was so well seasoned. Couldn't have changed anything. Not to mention the arroz con gandules brought me back to my grandma's cooking. Definitely will be ordering again from The Jibarito Stop.\n"}, {"user_id": "Mary W.", "rating": 5.0, "date": "2017-02-27", "text": "I was looking for a no-frills, delicious place to eat in Pilsen after visiting the National Museum of Mexican Art. I ordered the veggie jibarito, which came with two jibarito sandwiches, rice and beans for like $7.\n\nMy meal exceeded my expectations: the peppers and onions tasted really fresh and were well-seasoned, and were balanced well with a little crema. The plantain patties weren't too thick or starchy, and they tasted fresh and crispy on the outside. I ordered mine with no cheese, but that was also included. The rice was better than average and the beans were really flavorful, with little bits of onion and pumpkin. \n\nThe environment was nice-- a clean table, good natural light from the big windows in the front, not to loud.\n"}, {"user_id": "Edgar L.", "rating": 5.0, "date": "2016-09-10", "text": "Finally a spot south of Division that's actually good! Small menu but good. Good atmosphere and quick serves. Alcapurrias where just perfect. Not greasy at all\n"}, {"user_id": "Cindy G.", "rating": 4.0, "date": "2016-05-22", "text": "---------\nVery delicious!! \n\nTried the chicken and steak sandwich. Chicken was definitely the star out of the two! \n\nOnly regret is not getting an extra order of arroz con gandules, we devoured it!!\n"}, {"user_id": "Bettina S.", "rating": 4.0, "date": "2016-01-12", "text": "If you are on the south side you MUST check out Jibarito Stop. The former food truck turned restaurant is casual, fast, reasonably priced, and sooooo delicious. It was a welcome addition to the south side which is almost devoid of any Puerto Rican restaurants. There isn't a ton of seating so I wouldn't recommend bringing a large group but I would recommend bringing someone who likes to share so that you can really taste the menu. The staff is pretty awesome, and we're really helpful with recommendations.\n\nI went with a friend who got the steak jibarito, and I ordered empanada platter, and tostones, and a papa rellena. Yes I'm greedy; don't judge me.  Tip: try the Garlic oil with your tostones with a pinch of salt. Besides the over cooked tostones, everything I ordered was delicious, and came in well under $20. Next time I go, I'm getting my own jibarito.\n"}, {"user_id": "Shaakira J.", "rating": 4.0, "date": "2016-01-23", "text": "Yummy!\n\nI love jibaritos & tostones....\n\nI took one star away because I couldn't easily find the place (no sign/awning) and I didn't know if I was looking for a food truck or an actual building/store front.\n\nThe food was good and I'd def go back. They need these type of restaurants in the hood on the South Side .\n\n(I had the steak jibarito w/ yellow rice and peas, and a champagne cola) \n\nI tried some of the spicy mayo stuff on the rice and it was good too.\n\nJibaritos from up North taste a little better though... I think it's something in the seasonings this place uses... The steak was also extra tough.\n"}, {"user_id": "Jessie R.", "rating": 4.0, "date": "2016-05-05", "text": "I had the Canasta, which is 2 empanadas and rice. I had the shrimp filling and ordered it with arroz con gandules= DELICIOUS! I also ordered an alcapurria, this one was a little too dry for my taste, but the flavor was good. \n\nTo sum it up, the service was very friendly and welcoming. The food was flavorful. I will definitely be back to try the jibarito and other items on the menu. \n(I drove here from the Midway airport area and it was worth the drive.) \n\nP.S. \nStreet parking is limited.\n"}, {"user_id": "Baselia D.", "rating": 5.0, "date": "2017-02-16", "text": "I order for delivery through UberEATS and I will say this....I will be ordering from here from now on. Everything was still hot and the plantain remanded crispy and that's a big plus when it comes to ordering from anywhere. If the quality of there food stays this good I will continue coming back for more.\n"}, {"user_id": "Tania H.", "rating": 5.0, "date": "2017-02-15", "text": "Watch out Humboldt Park restaurants...your competition is on point. This is the only Puerto Rican restaurant in Pilsen. The food is flavorful and the portions are quite generous. I'm so grateful for this place. You should be too.\n"}, {"user_id": "Fatima S.", "rating": 5.0, "date": "2016-08-13", "text": "The quality of the food, and how it is presented deserves 5 stars. The price for an entree is very reasonable. \n\nI recommend it! Looking forward to \"stopping\" by again for another jibarito dinner.\n"}, {"user_id": "Raquel D.", "rating": 5.0, "date": "2016-01-06", "text": "YES A JIBARITO SHOP IN MY HOOD!!  I repeat, there is a new AWESOME jibarito restaurant super close to me.  This is very good.  I love jibaritos and PR food...and they do it up deliciously here.  Meat is flavorful and everything comes out fresh, so expect to wait..in a good way.  The papa relleno is AMAZING - deep fried goodness with ALOT of meat! Like super packed.  So delish.\nI'm screaming a lot here, but i'm just that HAPPY and EXCITED about this place being down the street.  My waistline is a little scared...but maybe i'll get lucky and get a j-lo bod.  hah!  Welcome to the neighborhood!!\n"}, {"user_id": "Jose A.", "rating": 5.0, "date": "2017-11-26", "text": "I have eaten in a lot of Puerto Rican restaurants this one is very good I would say it at the top of my list very good food friendly atmosphere and the food is very authentic. The portions of food fill you up.\n"}, {"user_id": "Todd L.", "rating": 5.0, "date": "2016-05-28", "text": "Now, being from the suburbs, I am not a jibarito veteran or anything, but I have had a few, and this one was the best that I've ever had.\nSteak was tender and juicy... not tough like it can be. And the pigeon rice was MAGNIFICENT! Bacon-y and al dente and scrumptious. I will be coming into Pilsen with the family for this again sometime very soon.\n"}, {"user_id": "Ivan R.", "rating": 1.0, "date": "2016-12-28", "text": "Every time I come or try to order this place there is always an issue. Never going here again!!\n"}, {"user_id": "Toni R.", "rating": 4.0, "date": "2016-10-25", "text": "This place never fail to hit the spot. Real authentic Puerto Rican food. Service is a little slow that's why I'm just giving it 4 stars. Nevertheless this is one of my favorite spot in Pilsen.\n"}, {"user_id": "C. Paula D.", "rating": 5.0, "date": "2015-11-23", "text": "We came here after spending the morning wandering the National Museum of Mexican Art (within walking distance)! The jibarito or sandwich with fried plantain as the bread is worth trying! Get the fried plaintains side too.  Cute decorations and fast service.\n"}, {"user_id": "Esteban S.", "rating": 5.0, "date": "2017-02-25", "text": "The food is great. The seasoning and  taste was very authentic.This place is one of my favorites\n"}, {"user_id": "Joo J.", "rating": 5.0, "date": "2017-08-12", "text": "What's a steak Jibarito?? Its soooo goood. Haven't had such a satisfying meal in awhile :)))\n"}, {"user_id": "Mimi L.", "rating": 5.0, "date": "2016-01-23", "text": "Yummi !! Beef alcapurria was the best! Great vegan choices, not a wide selection but what they do offer is Soo delicious\n"}, {"user_id": "Bert T.", "rating": 2.0, "date": "2015-12-04", "text": "My first time here and my first-ever jibarito. The twin mini-sandwiches (I had expected one larger sandwich) were tasty enough, but messy to deal with -- the fresh tomato and lettuce and the unneeded garlic mayonnaise instantly wilted on contact with the hot meat, producing major drippage. BTW this was not one or two slices of steak, as I had imagined, but a handful of tiny meat pieces -- OK I suppose. \n\nI was less pleased with the other items. Normally I LOVE maduros -- delicate pillows of sweet fried goodness. These were underripe and very dark, as if they were cooked in bad oil, or too long, or both. Yellow rice was dry and sticky. My shrimp empanada had a good flavor but, again, was dark brown instead of golden brown. \n\nThis is counter service cooked to order -- not fast food -- so don't go in a big hurry.\n\nPrices are reasonable. Staff were friendly. The music wasn't painfully loud, but loud enough that I couldn't quite hear what they were saying. \n\nPS while the address listed is correct, don't go by the map that pops up when you click on Yelp's direction link. They are a block east of the 18th St Pink Line stop, NOT down by the river -- very misleading!\n"}, {"user_id": "L M.", "rating": 5.0, "date": "2017-09-02", "text": "Everything is amazing!!! I love love love the shrimp empanadas. I over indulge every single time!\n"}, {"user_id": "Julie P.", "rating": 5.0, "date": "2016-10-31", "text": "YUM YUM YUM!!!! I love this place. Been here three times and have not been disappointed. My only complaint is that it takes a while for them to prepare my meal, but that's because they make it fresh-to-order. Planning on making my fourth trip back soon!!! :)\n"}, {"user_id": "Rogelio T.", "rating": 5.0, "date": "2017-01-07", "text": "First time customer and now I'm a loyal customer.this place has Humboldt park beat hands down.not the typical restaurant with paintings of the island but the photos the have capture the heart and soul of the Puerto Rican people\n"}, {"user_id": "Andrea R.", "rating": 2.0, "date": "2016-10-15", "text": "Food was tasty but overpriced! I walked in and sat down and didn't notice the tiny ORDER HERE sign propped by the register  I finally made my way over to the register after several minutes of making eye contact with the the person taking orders. She never bothered greeting us or at the least mention how we needed to place our order up front. Maybe she was having a bad day?!\n"}, {"user_id": "Dakota H.", "rating": 5.0, "date": "2016-10-12", "text": "I came here the other day with my friends and ordered a steak jibarrito.  It was our first time at this place. The garlic topping was amazing like no other, and we literally savored every bite. Best I've had so far. The service is pretty fast. The prices are reasonable.\n"}, {"user_id": "Moe H.", "rating": 2.0, "date": "2016-06-11", "text": "Haven't ate yet.... Taking long time for food to come.  Negative reviews for service thou!  Employee In a terrible mood just screamed at me and my daughter because we didn't see restroom light outside of the restroom!!!   Never again\n"}, {"user_id": "Shay J.", "rating": 5.0, "date": "2017-07-19", "text": "Sooooooo good! Every mouthful was so flavorful. Do yourself a favor and EAT HERE! YUMMY!\n"}, {"user_id": "Vany L.", "rating": 5.0, "date": "2015-10-24", "text": "The steak jibarito sandwich with queso chihuahua is the best, the shrimp empanadas and the platano maduro.\n"}, {"user_id": "Dental Sunshine P.", "rating": 4.0, "date": "2017-02-22", "text": "what can I say! the best Puerto Rican food by far! It taste authentic and home cooked!  We are a fan of the \" steak jibaritos\"! perfectly seasoned! Its like a having a piece of the island ( Puerto Rico) in the heart of Pilsen !\n"}, {"user_id": "Lulu G.", "rating": 5.0, "date": "2017-02-21", "text": "Nice having Puerto Rican food near South. The food was great. I had a jibarito with rice. Portions are good, food was flavorful. Wishing they had more seating space :)\n"}, {"user_id": "Rebecca R.", "rating": 5.0, "date": "2017-05-16", "text": "This place is phenomenal!  I often work nearby and I order take out whenever possible.  The plantains are perfect. The steak sandwich is their best menu item.  Perfectly cooked in garlic and onions and put in the middle of plantain patties.  You simply cannot go wrong with anything on the menu at Jibarito Stop.\n"}, {"user_id": "Hector M.", "rating": 5.0, "date": "2017-08-23", "text": "Best Jibaritos in town. Only in Chicago! 18st spot. Better than Humbolt Park. Hands down. I've had Papa's Cache, el borinque to several other in humbolt park but no not like this Jobarito Stop. Hands down!!!.best green garlic sauce ever. Dont forget to ask. The restaurant smell good and friendly atmosphere. Love it!, I'll be coming back soon.\n"}, {"user_id": "A A.", "rating": 1.0, "date": "2015-11-19", "text": "Meh. \n\nI was never a fan of the food truck. After trying it twice I'd come to the conclusion that it was just over-salted latin-inspired and not authentic. When they opened the restaurant I was hoping that having a proper kitchen and the food being cooked to order would make a difference. I decided to try it out again when they first opened. After waiting 20 minutes in line during my lunch hour they announced that they'd ran out of steak. I left without ordering.\n\nI was in the area today and decided to go back. Overall, I'll pass. There was no line so I was excited. Ordered the steak jibarito with white rice and beans. After getting my food, I was surprised it was served on a paper plate, but I thought \"ok-they just opened\". After digging into my food I was immediately regretful. The rice and beans were good, but I couldn't really enjoy because it was extremely salty. The jibarito was a generous size, but was lackluster at best. The steak had no flavor. Highlight of my meal was the Cola Champagne I ordered.\n\nI'm Puerto Rican so I was definitely looking forward to the food since its in my area. Sadly, Puerto Rican restaurants think because they put steak on a plantain it'll be a jibarito. Not so much. Flavor is a huge part. Won't be back, won't be recommending.\n"}, {"user_id": "Susie H.", "rating": 5.0, "date": "2017-08-02", "text": "LOVE LOVE LOVE this place! It's super chill so if you're expecting table service you came to the wrong spot. You order up front and then they bring you the food to your table but anything you need you get up and get yourself. The food is so delicious! Best of all, it's close to home so it saves me driving to the north side for Puerto Rican food. Give it a try, you'll love it!\n"}, {"user_id": "Edna R.", "rating": 5.0, "date": "2016-11-28", "text": "Great puertoRican food nice n Friendly people love this place you have to go And try this place out you won't regretted ...\n"}, {"user_id": "Jasmine G.", "rating": 5.0, "date": "2016-10-15", "text": "Order the steak Jibarito sandwich with arroz con grandules. I promise you, it's ahhhhhmazing. Great staff too!\n"}, {"user_id": "Barbara T.", "rating": 5.0, "date": "2017-01-08", "text": "There were 3 of us and none of us were disappointed. All the food was delicious! We had the pork platter, jibarito steak sandwich, beef empanadas, alcapurria, and arroz con gandulas. DELICIOUS! Not a fancy restaurant but who cares because the food is excellent!\n"}, {"user_id": "Sandy L.", "rating": 5.0, "date": "2016-11-20", "text": "So delicious! My favorite is the slow roasted pork jibarito. The meat is soft and well seasoned, the orange sauce (flavored mayo?) is creamy and cooling, and the plantain buns are always crispy and brushed with an amazing garlic oil. The beans and rice is AMAZING. Seriously my favorite thing there. Cream cheese flan in the fridge also gets a shout out. You won't be disappointed if you go here!\n"}, {"user_id": "Maritza D.", "rating": 5.0, "date": "2016-05-04", "text": "Best jibarito I've had. That garlic oil they use on the plantain is bomb. Great place.\n"}, {"user_id": "Miguel B.", "rating": 5.0, "date": "2016-06-12", "text": "It's a relief that I don't have to travel all the way up north for a tasty jibarito.  The meat was coked just right and the plantain was crunchy and not oily.  It comes with your choice of white or yellow rice.  I chose the yellow and it was mist and fluffy.  I certainly hope that this place stays.  Will definitely go again.\n"}, {"user_id": "Vegus C.", "rating": 5.0, "date": "2017-01-08", "text": "I absolutely love every time I come into this restaurant growing up in the Puerto Rican household I've always appreciated the mini great Puerto Rican food I was born and raised in New York and now I live in Chicago and I never imagined that I would find a place to call home I love everything from the empanadas jibarito sandwiches and mofongos & maduros if you ever in the Pilsen neighborhood in Chicago stopping and try the bass authentic Puerto Rican food in Chicago and make sure you have a horchata\n"}, {"user_id": "Rich L.", "rating": 5.0, "date": "2016-05-11", "text": "Love this spot.  Best Puerto Rican food this side of San Juan.  Also the ladies who run this place are seriously hot mamacitas.  ;) Ai Bendito!\n"}, {"user_id": "veronica m.", "rating": 4.0, "date": "2016-07-29", "text": "Loved the rice and beans, not a big fan of the jibarito just wanted to try this location but it didn't win me over, great service and environment though. Like the chalkboard on the wall and the music\n"}, {"user_id": "Betsy F.", "rating": 5.0, "date": "2016-10-01", "text": "Authentic, incredible flavors, taste even better than my Abuela's cooking! GREAT LOW PRICES. Empandas and lechon jibaritos are addictive. Potatoe salad is excellent. We would follow the food truck around town so glad they finally have a store front which is always kept clean!\n"}, {"user_id": "Reece R.", "rating": 5.0, "date": "2016-08-19", "text": "Puerto Rican joint on the South Side? What? Where have you been, this place is awesome and has a great Jibarito.\n"}, {"user_id": "Derrick B.", "rating": 5.0, "date": "2016-06-08", "text": "This food is so damn good I want to move next door.  The Empanada Shrimp are serious business.  Plantains are silky moist and the sauce is fire.\n"}, {"user_id": "Sonia F.", "rating": 5.0, "date": "2016-10-15", "text": "I was looking for a spot on the south side for puerto Rican food and I'm glad I found this spot!!! It's jibaritos and empanadas are delicious!!! You won't be disappointed.\n"}, {"user_id": "Elizabeth A.", "rating": 4.0, "date": "2016-07-18", "text": "They have amazing alcapurias. The Jabarito is good I tried the steak. It comes with puetorican rice or white rice.\n"}, {"user_id": "Tom K.", "rating": 3.0, "date": "2016-06-02", "text": "The Jibarito here was excellent. I loved it, and would certainly come again. Highly recommended.\n"}, {"user_id": "Jason S.", "rating": 5.0, "date": "2016-05-02", "text": "This was one of my favorite food trucks but as of last fall they've opened a brick and mortar restaurant in the Pilsen neighborhood...the perfect success story of how a person can start out with a food truck and grow their business into a restaurant. The food is always delicious and the service is great!\n"}, {"user_id": "Stehfahnee S.", "rating": 5.0, "date": "2016-08-30", "text": "So happy that there's now a Puerto Rican restaurant close by me! Little upset that they don't deliver to me seeing as though I'm barely a mile away but no problem. It was only an 8minute drive. The food is delicious though! I ordered a steak jibarito. The flavor hits you all at once. I will definitely be ordering here again.\n"}, {"user_id": "Amanda B.", "rating": 4.0, "date": "2016-07-08", "text": "El Jibarito was fantastic! This is definitely a no frills place, but delicious and not pricey. It was my first time here. Granted, I'm a fan of all types of hispanic food, but omg the empanadas were delicious. I think the beef and cheese was better than the shrimp, but both were delicious. I also had the white rice with beans and mixed in some tapa tio sauce and chipotle mayo to spice it up. The shrimp empanada was listed as spicy, but I felt that it could have had a bit more flavor... All in all, definitely a place to try out if you are a fan of delicious food, good prices, and don't mind no frills. :)\n"}, {"user_id": "Bianca R.", "rating": 5.0, "date": "2015-12-30", "text": "So glad I stopped in and tried the Jibarito! My 1 year old son danced to the music while he enjoyed his papa rellena! *Suggestion: I know PR food doesn't use a lot heat but if you're gonna add a PR spot to Pilsen, offer some type spice besides Valentina hot sauce.  Cafe Central offers a simple jalapeno salsa, something similar would be great! I'll be back really soon!\n"}, {"user_id": "Y L.", "rating": 5.0, "date": "2017-02-22", "text": "You get a lot (and very good) food for the money. For less than $20 (including tip), we got a pork jibarito with white rice and beans, and an empanada basket with arroz con gandules. Everything was delicious and well seasoned. The surprise was the white rice and beans; it was so good, I could have just eaten the white rice alone.\n"}, {"user_id": "Judith A.", "rating": 4.0, "date": "2016-05-14", "text": "Great place for Jibaritos. The plantain seasonings were very tasty. Prices are very reasonable.\n"}, {"user_id": "Isaac G.", "rating": 5.0, "date": "2017-05-25", "text": "Love the food !! I love the slow roasted pork jibarito. My favorite are the Maduros  amazing food and service.\n"}, {"user_id": "Myahsunbeam R.", "rating": 5.0, "date": "2015-12-31", "text": "I came in today w my mom & we were both so satisfied! i'm glad that the original place we were going to was closed because we found this gem! I usually am not one to eat a jibarito & was just going to sub out for bread, but i'm actually happy that wasn't an option. I enjoyed my jibarito soooooo much, so did my mom. we loved that the platano wasn't super thick (which is why I usually steer away from getting it) & it was able to get crunchy. I love garlic, so the flavors were so good! I also had the carne y queso empanadas & loved those also, I have one to take home & enjoy later. the staff was very friendly. I just wish this place was closer to me!!!\n"}, {"user_id": "Vanessa S.", "rating": 5.0, "date": "2016-01-01", "text": "First experience was seeing the food truck by chance over by the Merchandise Mart. Was so excited to find them on Grubhub, we've ordered 3 times in less than 2 weeks! Had to call in one time because I goofed our order,  the lady on the phone was very helpful and super accommodating with the addition to the order.  Going into the restaurant tomorrow for lunch! The food has great flavor and the portions are generous (island-style! ) , so glad they're here and open in Pilsen. This is just what Pilsen/South Loop needed!\n"}, {"user_id": "Charlie D.", "rating": 5.0, "date": "2017-04-11", "text": "Everything I had here was great. Jibarito steak sandwich, rice, and the sweet plantains\n"}, {"user_id": "Stephanie E.", "rating": 5.0, "date": "2016-07-20", "text": "This is the first time I have ordered from this location for delivery; I have been to the actual restaurant and it is a nice establishment. I do love their empanadas; they are good as usual. This time I tried the chicken breast jibarito with yellow rice and it was amazing (and this is my first time trying a chicken jibarito lol). Next time I will definitely try their steak jibaritos. Overall great food!\n"}, {"user_id": "Don M.", "rating": 4.0, "date": "2016-01-08", "text": "This was my first time here and i have to say everything was awesome, i had the Jibarito sandwich bistec, it was so good the meat was very tender, and the plantains were cook just right, with lots of garlic butter, my hands still smell like garlic, i also had the white beans and rice, you get rice on your plate and a cup of beans with the delicious sauce that you pour over your rice it was heavenly tasty, and then i had Papa Rellena, this is a stuffed potato ball with meat inside the flavors were just bursting out with each bite, i also tried Alcapurria, a Yuca fritter, OMG the flavors i tasted were fanominal, i could have made a meal out of these alone, so to sum it up i will definitely be going back to try the Shrimp Empanadas and more, if your ever in the neighborhood give the Jibarito Stop a try, you to will say, ill be back\n"}, {"user_id": "Pilsen P.", "rating": 5.0, "date": "2016-03-30", "text": "Really good empanadas! The rice is on point also  the prices are kinda high to if you are going with a like 3 people expect to spend about $60+ in order to try everything from the menu. I suggest get a little bit of everything also the sauce for the empanadas is made there and it's really good. The plantains are amazing also! This is a great place for Pilsen and the location is perfect very casual place and good vibes always!\n"}, {"user_id": "Lia N.", "rating": 3.0, "date": "2016-05-12", "text": "For jibaritos I travel to the northside, but once I saw this place I thought no more traveling to the northside yay! I finally tried their jibarito, I ordered the steak with Arroz con gandules. The place is nice, small, clean, tables are kinda sticky but I'm assuming because of the coat of paint on it which is kinda weird. You order at the counter and they bring the food out to you also you take your drink with you when you order, they won't bring it to you. Service was okay. The food was good but I hate to say the plantain was soggy and not crunchy, the meat was good with overflowing juices, the rice was ok I've had better. This place is good but not great. I think I'll continue going to the northside for the quality of food.\n"}, {"user_id": "Araceli S.", "rating": 4.0, "date": "2016-05-06", "text": "I loved loved the place is so close to home we needed some Puerto Rican food around... Service was beyond excellent and jibarito very filling and so good! I wish they can add more variation to the menu and they will get my 5 stars\n"}, {"user_id": "T S.", "rating": 3.0, "date": "2016-10-09", "text": "Decent enough to eat it all, but bland enough to complain about eating it all. We shared one steak and one chicken sandwich. Those were pretty good, but like I said, hella bland. It needed some spice or something. Ingredients seemed of good quality but it was the flavor that was lacking. Also, the shrimp empanada for $3 was alright, not worth it. Don't get me wrong, I did enjoy the meal, I just wish it was a little bit better.\n"}, {"user_id": "Marisol D.", "rating": 5.0, "date": "2016-04-15", "text": "Have been craving Puerto Rican food lately and came across this place on grubhub. Decided to give it a try. I ordered the steak jibarito that came with Arroz con gandules, and i aslo ordered a beef empanada, and a side of mayo ketchup. Order came with in 25-30 minutes. I completely loved it! Will definitely be ordering from here more often !\n"}, {"user_id": "Marcos F.", "rating": 5.0, "date": "2016-04-02", "text": "Love at first bite!The Jibarito sandwich with steak so good!!! The steak so tender and well flavored. soft crunchy plantain.Arroz con gondules were a hit.I see me coming here a couple time a week.\n"}, {"user_id": "Jada F.", "rating": 5.0, "date": "2016-02-28", "text": "Foodgasm! BEST shrimp empanadas EVER!! I really hope they bring back the chicken empanadas :( Those were amazing as well. Delicious sauce to accompany the empanadas. Jibarito is ok. Arroz con gandules have a ton of flavor. Definitely try the shrimp empanadas!!!\n"}, {"user_id": "Mander A.", "rating": 5.0, "date": "2016-02-25", "text": "This is a great spot if you want to eat delicious Puerto  Rican food. The staff are super nice and helpful. We had the steak jibarito as well as the pork jibarito with an appetizer of empanadas.  You can't go wrong with anything in their menu. Awesome food and great service. We will be back!!!!!\n"}, {"user_id": "Cynthia A.", "rating": 5.0, "date": "2015-10-29", "text": "Me and my sister have been driving all the way to borinquen for years to get our jibarito fix and now we are so thrilled to welcome this tasty Puerto Rican gem into our hood! Gracias dios santo for this delicious food! My sisters client Adolfo said that his sister opened up this place in Pilsen and that we should try it. We did today and we are so glad we did. The jibaritos are DELICIOUS! I will mention the girl who took my phone order seemed a little bit scattered and when I arrived they realized they gave my order to someone else so I had to wait a little bit. But Alex was very apologetic and even threw in a papa rellena for me to try on the house! Great customer service. I will most definitely return. Welcome to the neighborhood hermanos!\n"}, {"user_id": "City D.", "rating": 5.0, "date": "2016-10-08", "text": "The steak Jibarito sandwich was excellent.  I had heard it was good, but was surprised how good it really was.   Loved the garlic on the plantain and the steak was tender.   Also had the rice and pigeon peas and thought that was good too.   Can't wait to go back.\n"}, {"user_id": "Jah T.", "rating": 1.0, "date": "2016-10-21", "text": "Fellow food critic and NATIVE here.  \nI went in around the afternoon midday to introduce myself as the food critic,in the afternoon and was pretty much brushed off by a woman with a dark ponytail.  But I didn't let the rude wait staff deter me.  I ordered the empañada basket, which was a total of close to $10. I was handed a small container of rice and 2 small empañadas, the empañadas were freshly hot and pretty good.  But The arroz con granules was a bit under cooked. For 10$.. \n\nI mean, picture this..  Your whole life, you've known arroz con grandules to be well seasoned Moist and al dente.  Picture shattered! I asked the cook about the rice and he literally sucked his teeth and sighed. I understand, you probably worked incredibly hard on the rice.  And it still didn't turn out the way, intended.  I wasn't offering a whole new order to replace it.  \n\nWhile the wait time was just about 12 mins, (which was totally fine because, I needed time gather myself and eat before heading to a meeting) The scenery of the lobby was dimly lit and had some pretty good room for seating.  Not exactly a full house in the afternoon where in lunch..  Most of the strip is crawling with people.  But this was full only by the definition of just 2 small tables that were full. I'd says it's intimate enough if you're looking for a window view.  \nDetail by scenery: the windows weren't clean,and the floor looked like it hadn't been swepted or mopped.  And when I inquired about a restroom the cook in the back ( a younger short dark haired man) looked directly passed me. All of 25mins of being in this place, not only did I feel unwelcome.  Nothing says unwelcome than paying $10 for under cooked food and wait staff who don't know how to use their words. \nNow.. To my understanding, it took the owners (2 Latinas from the other side of the city) a hot minute to get the establishment up. That's neither here nor there.  Because What's absolutely unacceptable is, the attitude of their wait staff and the very lack of cleanliness..  \nIf the crowd dies down or is just slow paced kinda day, you'll have walk the time in the world to catch up on simple spot cleaning.  \n\nHere's a tip: \nwe Southsiders are prettttty forgiving in these cases.  Yes, there's a plethora of problems that are totally common in restaurants, however that doesn't absolve you of a responsibility that you owed, to the general public. While There's much potential to grow here and there's room for everyone.  Let's be real, it can get really lonely during those winter hours, having a so uno customers, and last time I checked.  Having only 2 full tables out such a generous space isn't for exactly \"making it\" ..  So if you want our services, act right.  Train your staff and check your condescending attitudes and entitlement before you come to work.  This is literally how you lose customers regardless of how far they travel to come to frequent your space.  Lastly, CLEAN YOUR STORE!\n"}, {"user_id": "Mari P.", "rating": 1.0, "date": "2016-03-29", "text": "This place is horrible. The pork was dry they barley put any in the platter it was more rice then anything. When I relieved it three grub hub the grease was spilled everywhere. The only park that was good was the one piece of skin I got on the pork platter. Will not be going here and I will make sure I tell people it's horrible.\n"}, {"user_id": "Stan V.", "rating": 5.0, "date": "2016-05-15", "text": "Living in Pilsen, I heard of this place a million times. I had to try it. I ordered a steak jabarito to go. They were really nice people and the food was amazing. I don't just through around five stars... I think they were that  great. The cooks looked a little grumpy, lol, buy hey... that's fine. They make amazing food, you can be grumpy:)  I highly recommend them.\n"}, {"user_id": "Sarah C.", "rating": 5.0, "date": "2015-11-10", "text": "The Jibarito Stop just opened up a new restaurant a few blocks from my work, and I couldn't be more excited.  Always on the lookout for new lunch places and eager to support new local businesses, myself and the rest of the folks in my office decided to order take out and give it a go.  The reviews were unanimous... the food was delicious.  Given that the name of the restaurant is the Jibarito Stop, I figured I had no choice but to try a Jibarito.  I was a little skeptical on the combination of ingredients (not being a huge plantain fan), but figured \"when in Rome!\".  I couldn't have been happier with my choice.  I chose a Steak Jibarito, which comes with a big ol' serving of arroz con gandules (rice with pigeon peas).  The steak was wonderfully seasoned, and the plantain \"bun\" gave it just the right flavor.  Very happy to see such a great addition to the neighborhood and looking forward to trying some more items from the menu!\n"}, {"user_id": "Dan O.", "rating": 5.0, "date": "2016-03-29", "text": "This food was amazing, so much so that I had to write a yelp review!  The veggie jibarito rocked my world and even the white rice and beans were well seasoned.  I want to come back!  My only complaint was the styrofoam cups and plastic utensils.\n"}, {"user_id": "Amanda P.", "rating": 5.0, "date": "2016-03-28", "text": "I am very disappointed in myself.  I thought I had given The Jibarito Stop their 5 star reviews ages ago!  \nI started off frequenting The Jibarito Stop when they were a food truck in the Loop.  They have, hands down, the best beef and cheese empanadas. Now that their store front is open in Pilsen, The Jibarito Stop is finally able to serve their name sake sandwich.  My go to is the steak jibarito. It is piled with tender, flavorful steak and topped with your choice of cheese.  You cannot go wrong with this classic.  I have my husband stop in every 6 weeks on his way home from getting a hair cut near Bridgeport.  The food is so good I don't even care that it is usual cold by the time I make it home from work. I don't think there is much higher praise than still good when room temp!  \nSo trust me, go get a jibarito and some beef empanadas and if there is flan available, grab that too.  You can thank me when you wake from your food coma\n"}, {"user_id": "Jessica G.", "rating": 2.0, "date": "2016-03-10", "text": "Not the best puerto rican food. Since its the only one on the south side it will do. Being puerto rican i suggest to use fresh made sofrito its lacking the flavor.\n"}, {"user_id": "Daniel R.", "rating": 5.0, "date": "2016-04-24", "text": "Great food! The steak jibarito is amazing! Staff is always friendly and food comes out hot and fast! A great addition to 18th street eateries.\n"}, {"user_id": "Carl P.", "rating": 5.0, "date": "2016-02-20", "text": "Been here quite a few times, the food is fantastic and affordable, best Jibarito in town IMHO. I usually get the pork with pepperjack cheese, with the beans and white rice.  Also get the flan, delicious!\n"}, {"user_id": "Remesis G.", "rating": 5.0, "date": "2016-02-01", "text": "What a great restaurant! I discovered this place on Grubhub and it was great. There aren't a lot of Puerto Rican restaurants in the South Loop/Pilsen and this place is a godsend. I had the steak jibarito which was delicious. It came with yummy yellow rice with peas. The empanadas are unbelievable. You have to order them. They're huge! We also had the fried plantains (rostones) and they were great too. There just weren't alot of them. Lastly, we had the whipped potatoes as a side. I was surprised because they were COLD. I think that is how they are supposed to be served but I wasn't expecting it.other than that, this place is a very value and I'll be back!\n"}]